[
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 75.99,
        "image": "https://contents.mediadecathlon.com/p2579115/k$a4e5545d7b3c735722072c33202b5eb5/sq/winterschuhe-herren-warm-wasserdicht-winterwandern-sh100-blau.jpg?format=auto&f=969x969",
        "countInStock": 38,
        "colors": [
            "Black",
            "White",
            "Red"
        ],
        "sizes": [
            "XL"
        ],
        "description": "sleep on your face destroy the blinds. Jump around on couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red",
        "numReviews": 1,
        "reviews": [
            {
                "author": "Trudy",
                "text": "topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton",
                "date": "2021-11-07",
                "rating": 4
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 30.99,
        "image": "https://contents.mediadecathlon.com/p2579568/k$376c6239f4c6a4d0a5e76307b4397545/sq/wanderschuhe-mh120-halbhoch-wasserdicht-kinder-gr-3538-turkis.jpg?format=auto&f=969x969",
        "countInStock": 56,
        "colors": [
            "Green",
            "White",
            "Black",
            "Blue"
        ],
        "sizes": [
            "M",
            "L"
        ],
        "description": "for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun",
        "numReviews": 16,
        "reviews": [
            {
                "author": "Sybil",
                "text": "sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate",
                "date": "2023-08-11",
                "rating": 4
            },
            {
                "author": "Charlie",
                "text": "liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow",
                "date": "2023-11-09",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love",
                "date": "2023-08-23",
                "rating": 4
            },
            {
                "author": "Charlie",
                "text": "Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2021-05-16",
                "rating": 4
            },
            {
                "author": "Charlie",
                "text": "I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love",
                "date": "2023-11-21",
                "rating": 5
            },
            {
                "author": "Frank",
                "text": "ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée",
                "date": "2022-12-06",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love",
                "date": "2023-11-29",
                "rating": 4
            },
            {
                "author": "Dave",
                "text": "chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o",
                "date": "2022-01-24",
                "rating": 3
            },
            {
                "author": "Dave",
                "text": "love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes",
                "date": "2023-02-22",
                "rating": 5
            },
            {
                "author": "Heidi",
                "text": "carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum",
                "date": "2022-01-21",
                "rating": 3
            },
            {
                "author": "Kim",
                "text": "cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie",
                "date": "2022-03-12",
                "rating": 4
            },
            {
                "author": "Judy",
                "text": "love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie",
                "date": "2023-02-16",
                "rating": 3
            },
            {
                "author": "Judy",
                "text": "Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding sweet muffin.",
                "date": "2022-04-24",
                "rating": 3
            },
            {
                "author": "Victor",
                "text": "dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar",
                "date": "2021-07-23",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit",
                "date": "2020-08-04",
                "rating": 5
            },
            {
                "author": "Alice",
                "text": "pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2022-05-21",
                "rating": 5
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 80.99,
        "image": "https://contents.mediadecathlon.com/p2164495/k$6df40368e2b7ac6d887b55812f132d71/sq/wanderschuhe-herren-atmungsaktiv-escape-500-fresh.jpg?format=auto&f=969x969",
        "countInStock": 69,
        "colors": [
            "Blue",
            "Black",
            "Green",
            "Red"
        ],
        "sizes": [
            "M",
            "XL",
            "L"
        ],
        "description": "get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch. Chew iPad power",
        "numReviews": 5,
        "reviews": [
            {
                "author": "Sybil",
                "text": "gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2020-12-26",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu.",
                "date": "2022-06-11",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding sweet",
                "date": "2021-03-27",
                "rating": 3
            },
            {
                "author": "Grace",
                "text": "tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat",
                "date": "2022-10-09",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake",
                "date": "2023-03-26",
                "rating": 5
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 60.99,
        "image": "https://contents.mediadecathlon.com/p2579497/k$11bdadeb50c9743829241be7aa67d124/sq/winterschuhe-damen-halbhoch-warm-wasserdicht-winterwandern-sh500.jpg?format=auto&f=969x969",
        "countInStock": 27,
        "colors": [
            "Red",
            "Black",
            "Blue",
            "White"
        ],
        "sizes": [
            "S",
            "L"
        ],
        "description": "the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch. Chew iPad power cord soft kitty",
        "numReviews": 0,
        "reviews": [],
        "averageRating": 0
    },
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 70.99,
        "image": "https://contents.mediadecathlon.com/p2579290/k$8468656899ba30e314aff19f13e104bf/sq/winterschuhe-damen-halbhoch-leder-warm-wasserdicht-winterwandern-sh900-braun.jpg?format=auto&f=969x969",
        "countInStock": 75,
        "colors": [
            "Green",
            "Blue",
            "Red",
            "White",
            "Black"
        ],
        "sizes": [
            "M"
        ],
        "description": "given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet",
        "numReviews": 4,
        "reviews": [
            {
                "author": "Ivan",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy",
                "date": "2020-01-11",
                "rating": 3
            },
            {
                "author": "Pat",
                "text": "candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear",
                "date": "2022-06-20",
                "rating": 3
            },
            {
                "author": "Quincy",
                "text": "roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice",
                "date": "2022-12-31",
                "rating": 3
            },
            {
                "author": "Sybil",
                "text": "love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop",
                "date": "2020-11-06",
                "rating": 4
            }
        ],
        "averageRating": 3.2
    },
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 90.99,
        "image": "https://contents.mediadecathlon.com/p2579242/k$626aeecd798bc629b208147cd263b0e3/sq/winterschuhe-herren-leder-hoch-warm-wasserdicht-winterwandern-sh900-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 41,
        "colors": [
            "Black",
            "Green",
            "White"
        ],
        "sizes": [
            "M",
            "L",
            "XL"
        ],
        "description": "imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the",
        "numReviews": 20,
        "reviews": [
            {
                "author": "Eve",
                "text": "candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish",
                "date": "2021-02-10",
                "rating": 3
            },
            {
                "author": "Pat",
                "text": "bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah",
                "date": "2021-10-11",
                "rating": 3
            },
            {
                "author": "Pat",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread",
                "date": "2023-02-08",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2023-09-04",
                "rating": 5
            },
            {
                "author": "Alice",
                "text": "amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I",
                "date": "2022-11-23",
                "rating": 3
            },
            {
                "author": "Randy",
                "text": "sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o",
                "date": "2021-09-28",
                "rating": 5
            },
            {
                "author": "Pat",
                "text": "sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie",
                "date": "2020-12-27",
                "rating": 4
            },
            {
                "author": "Bob",
                "text": "jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy",
                "date": "2020-12-13",
                "rating": 5
            },
            {
                "author": "Andreea",
                "text": "tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet.",
                "date": "2020-03-19",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum",
                "date": "2022-01-02",
                "rating": 5
            },
            {
                "author": "Quincy",
                "text": "pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I",
                "date": "2024-01-03",
                "rating": 3
            },
            {
                "author": "Ivan",
                "text": "jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie",
                "date": "2023-02-13",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon",
                "date": "2023-01-28",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread.",
                "date": "2021-07-10",
                "rating": 3
            },
            {
                "author": "Heidi",
                "text": "Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes",
                "date": "2022-02-08",
                "rating": 5
            },
            {
                "author": "Quincy",
                "text": "Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice",
                "date": "2023-05-02",
                "rating": 5
            },
            {
                "author": "Grace",
                "text": "snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love",
                "date": "2024-02-07",
                "rating": 3
            },
            {
                "author": "Dave",
                "text": "love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes",
                "date": "2022-07-07",
                "rating": 5
            },
            {
                "author": "Nia",
                "text": "Cupcake ipsum dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I",
                "date": "2021-04-20",
                "rating": 4
            },
            {
                "author": "Judy",
                "text": "love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar",
                "date": "2022-03-20",
                "rating": 3
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 70.99,
        "image": "https://contents.mediadecathlon.com/p2579406/k$dd7323636ecc4c363aeb30ea78693e97/sq/wanderschuhe-crossrock-halbh-wasserdicht-schnellschnurung-kinder-gr-2834-grau.jpg?format=auto&f=969x969",
        "countInStock": 74,
        "colors": [
            "Red",
            "Blue",
            "Black",
            "Green"
        ],
        "sizes": [
            "M",
            "S",
            "L",
            "XL"
        ],
        "description": "couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet",
        "numReviews": 17,
        "reviews": [
            {
                "author": "Randy",
                "text": "biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon",
                "date": "2020-07-16",
                "rating": 3
            },
            {
                "author": "Sybil",
                "text": "brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2020-12-27",
                "rating": 5
            },
            {
                "author": "Trudy",
                "text": "cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream",
                "date": "2020-10-09",
                "rating": 5
            },
            {
                "author": "Kim",
                "text": "love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding",
                "date": "2021-09-08",
                "rating": 5
            },
            {
                "author": "Nia",
                "text": "candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet.",
                "date": "2022-09-16",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll",
                "date": "2020-02-10",
                "rating": 4
            },
            {
                "author": "Oscar",
                "text": "chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee",
                "date": "2021-04-23",
                "rating": 4
            },
            {
                "author": "Bob",
                "text": "cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2023-11-25",
                "rating": 3
            },
            {
                "author": "Randy",
                "text": "jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2021-04-16",
                "rating": 5
            },
            {
                "author": "Mallory",
                "text": "Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love",
                "date": "2022-08-17",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread",
                "date": "2021-11-18",
                "rating": 5
            },
            {
                "author": "Victor",
                "text": "sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love",
                "date": "2021-06-01",
                "rating": 3
            },
            {
                "author": "Dave",
                "text": "Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake",
                "date": "2023-08-07",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake.",
                "date": "2024-01-04",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie",
                "date": "2021-08-09",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah",
                "date": "2020-01-10",
                "rating": 4
            },
            {
                "author": "Victor",
                "text": "oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o",
                "date": "2022-08-20",
                "rating": 3
            }
        ],
        "averageRating": 4.1
    },
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 65.99,
        "image": "https://contents.mediadecathlon.com/p2579512/k$b560a0b2371ca770ca6b63a5b09cc3fe/sq/wanderschuhe-crossrock-halbh-wasserdicht-schnellschnurung-kinder-gr-3538-grau.jpg?format=auto&f=969x969",
        "countInStock": 81,
        "colors": [
            "Green",
            "Red",
            "Black",
            "Blue",
            "White"
        ],
        "sizes": [
            "L",
            "XL",
            "M",
            "S"
        ],
        "description": "yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red",
        "numReviews": 12,
        "reviews": [
            {
                "author": "Mallory",
                "text": "tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet.",
                "date": "2021-10-28",
                "rating": 4
            },
            {
                "author": "Charlie",
                "text": "love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice",
                "date": "2020-07-22",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet",
                "date": "2020-03-10",
                "rating": 3
            },
            {
                "author": "Eve",
                "text": "Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow",
                "date": "2021-09-20",
                "rating": 3
            },
            {
                "author": "Trudy",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I",
                "date": "2020-09-06",
                "rating": 5
            },
            {
                "author": "Eve",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake",
                "date": "2023-04-16",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I",
                "date": "2021-04-05",
                "rating": 3
            },
            {
                "author": "Barış",
                "text": "snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly",
                "date": "2020-05-28",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love",
                "date": "2020-07-30",
                "rating": 5
            },
            {
                "author": "Grace",
                "text": "Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I",
                "date": "2020-01-28",
                "rating": 5
            },
            {
                "author": "Quincy",
                "text": "bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I",
                "date": "2022-12-19",
                "rating": 5
            },
            {
                "author": "Dave",
                "text": "love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie",
                "date": "2020-11-30",
                "rating": 4
            }
        ],
        "averageRating": 4.1
    },
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 99.99,
        "image": "https://contents.mediadecathlon.com/p2578997/k$0ee93cfa5084bc45b18fc1aaf019d15f/sq/winterschuhe-kinder-gr-2434-leder-klett-warm-wasserdicht-sh500-braun.jpg?format=auto&f=969x969",
        "countInStock": 76,
        "colors": [
            "Black",
            "White",
            "Blue",
            "Red",
            "Green"
        ],
        "sizes": [
            "XL",
            "M",
            "S",
            "L"
        ],
        "description": "bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord.",
        "numReviews": 7,
        "reviews": [
            {
                "author": "Dave",
                "text": "gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart",
                "date": "2023-12-24",
                "rating": 5
            },
            {
                "author": "Quincy",
                "text": "sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream",
                "date": "2022-04-15",
                "rating": 3
            },
            {
                "author": "Eve",
                "text": "marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie",
                "date": "2021-11-29",
                "rating": 5
            },
            {
                "author": "Sybil",
                "text": "brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum",
                "date": "2021-10-07",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake",
                "date": "2020-06-09",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice",
                "date": "2020-08-14",
                "rating": 5
            },
            {
                "author": "Nia",
                "text": "I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll",
                "date": "2023-06-26",
                "rating": 4
            }
        ],
        "averageRating": 4.3
    },
    {
        "name": "EVADICT",
        "category": "shoes",
        "price": 120.99,
        "image": "https://contents.mediadecathlon.com/p2317397/k$fb9833d2b796c77819288d11d770da5f/sq/laufschuhe-trail-mt2-herren-blaugrun.jpg?format=auto&f=969x969",
        "countInStock": 14,
        "colors": [
            "Red",
            "Black",
            "Green",
            "Blue"
        ],
        "sizes": [
            "XL",
            "M",
            "S"
        ],
        "description": "going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun",
        "numReviews": 14,
        "reviews": [
            {
                "author": "Barış",
                "text": "cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping.",
                "date": "2021-06-02",
                "rating": 4
            },
            {
                "author": "Nia",
                "text": "tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping.",
                "date": "2022-03-29",
                "rating": 3
            },
            {
                "author": "Judy",
                "text": "cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon",
                "date": "2021-07-11",
                "rating": 5
            },
            {
                "author": "Charlie",
                "text": "Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love",
                "date": "2020-10-21",
                "rating": 4
            },
            {
                "author": "Pat",
                "text": "jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate",
                "date": "2022-09-15",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton",
                "date": "2020-08-22",
                "rating": 3
            },
            {
                "author": "Grace",
                "text": "tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop.",
                "date": "2020-04-30",
                "rating": 5
            },
            {
                "author": "Eve",
                "text": "candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love",
                "date": "2023-05-05",
                "rating": 5
            },
            {
                "author": "Ömer",
                "text": "tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie",
                "date": "2023-03-11",
                "rating": 4
            },
            {
                "author": "Grace",
                "text": "oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut",
                "date": "2022-11-10",
                "rating": 3
            },
            {
                "author": "Frank",
                "text": "soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu",
                "date": "2021-10-27",
                "rating": 4
            },
            {
                "author": "Barış",
                "text": "gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie",
                "date": "2024-01-19",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum",
                "date": "2021-06-04",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread",
                "date": "2021-05-18",
                "rating": 4
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 85.99,
        "image": "https://contents.mediadecathlon.com/p2583208/k$98aafedc771378d6f8762fdd7082ec27/sq/wanderschuhe-herren-nh100-halbhoch-grau.jpg?format=auto&f=969x969",
        "countInStock": 84,
        "colors": [
            "White",
            "Black",
            "Blue",
            "Red",
            "Green"
        ],
        "sizes": [
            "S",
            "L",
            "M"
        ],
        "description": "to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch. Chew iPad power cord",
        "numReviews": 9,
        "reviews": [
            {
                "author": "Ömer",
                "text": "cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding",
                "date": "2020-12-24",
                "rating": 5
            },
            {
                "author": "Alice",
                "text": "cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie",
                "date": "2020-01-26",
                "rating": 3
            },
            {
                "author": "Charlie",
                "text": "caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake",
                "date": "2020-11-10",
                "rating": 3
            },
            {
                "author": "Bob",
                "text": "snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton",
                "date": "2020-09-28",
                "rating": 3
            },
            {
                "author": "Barış",
                "text": "bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I",
                "date": "2023-05-13",
                "rating": 4
            },
            {
                "author": "Victor",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton",
                "date": "2021-03-12",
                "rating": 3
            },
            {
                "author": "Randy",
                "text": "Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly",
                "date": "2021-11-07",
                "rating": 5
            },
            {
                "author": "Heidi",
                "text": "jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut",
                "date": "2021-02-28",
                "rating": 3
            },
            {
                "author": "Randy",
                "text": "tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread",
                "date": "2021-05-16",
                "rating": 4
            }
        ],
        "averageRating": 3.7
    },
    {
        "name": "FORCLAZ",
        "category": "shoes",
        "price": 115.99,
        "image": "https://contents.mediadecathlon.com/p2573016/k$2534236b7289f69b09ddc7087894f903/sq/trekkingschuhe-herren-leder-hoch-breit-wasserdicht-bergwandern-mt100.jpg?format=auto&f=969x969",
        "countInStock": 25,
        "colors": [
            "Blue",
            "Black",
            "Red"
        ],
        "sizes": [
            "XL",
            "L"
        ],
        "description": "bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going",
        "numReviews": 12,
        "reviews": [
            {
                "author": "Kim",
                "text": "jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee",
                "date": "2023-01-08",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice",
                "date": "2023-10-20",
                "rating": 5
            },
            {
                "author": "Dave",
                "text": "biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love",
                "date": "2023-12-22",
                "rating": 3
            },
            {
                "author": "Frank",
                "text": "sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice",
                "date": "2024-02-09",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot",
                "date": "2021-03-09",
                "rating": 5
            },
            {
                "author": "Andreea",
                "text": "sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding sweet",
                "date": "2023-02-19",
                "rating": 5
            },
            {
                "author": "Frank",
                "text": "chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple",
                "date": "2022-07-17",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps",
                "date": "2022-09-02",
                "rating": 5
            },
            {
                "author": "Sybil",
                "text": "bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love",
                "date": "2022-03-19",
                "rating": 4
            },
            {
                "author": "Dave",
                "text": "lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie",
                "date": "2023-04-06",
                "rating": 5
            },
            {
                "author": "Grace",
                "text": "love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut",
                "date": "2020-09-02",
                "rating": 5
            },
            {
                "author": "Pat",
                "text": "sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice",
                "date": "2021-08-30",
                "rating": 4
            }
        ],
        "averageRating": 4.4
    },
    {
        "name": "DOMYOS",
        "category": "T-shirt",
        "price": 0.99,
        "image": "https://contents.mediadecathlon.com/p2415460/k$0deb88a531ff2a015e7b87f3cdccd161/sq/t-shirt-herren-rundhalsausschnitt-regular-500-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 28,
        "colors": [
            "Red",
            "White",
            "Blue",
            "Green",
            "Black"
        ],
        "sizes": [
            "XL",
            "L",
            "S",
            "M"
        ],
        "description": "now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe",
        "numReviews": 0,
        "reviews": [],
        "averageRating": 0
    },
    {
        "name": "SIMOND",
        "category": "T-shirt",
        "price": 20.99,
        "image": "https://contents.mediadecathlon.com/p2037327/k$43449ce0aa79a0931e79182d77808cdd/sq/t-shirt-langarm-seamless-wolle-bergsteigen-damen.jpg?format=auto&f=969x969",
        "countInStock": 7,
        "colors": [
            "Blue",
            "Green",
            "Red",
            "White"
        ],
        "sizes": [
            "L",
            "M"
        ],
        "description": "Jump around on couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that",
        "numReviews": 15,
        "reviews": [
            {
                "author": "Grace",
                "text": "shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2021-12-27",
                "rating": 3
            },
            {
                "author": "Mallory",
                "text": "love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread",
                "date": "2021-12-14",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream",
                "date": "2021-07-19",
                "rating": 3
            },
            {
                "author": "Victor",
                "text": "love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I",
                "date": "2022-01-31",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate",
                "date": "2021-09-21",
                "rating": 3
            },
            {
                "author": "Alice",
                "text": "dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah",
                "date": "2020-10-16",
                "rating": 3
            },
            {
                "author": "Andreea",
                "text": "biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie",
                "date": "2022-11-16",
                "rating": 3
            },
            {
                "author": "Oscar",
                "text": "carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut",
                "date": "2022-03-17",
                "rating": 3
            },
            {
                "author": "Quincy",
                "text": "lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton",
                "date": "2023-04-10",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice",
                "date": "2022-02-13",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop",
                "date": "2021-02-01",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie",
                "date": "2022-12-31",
                "rating": 3
            },
            {
                "author": "Kim",
                "text": "chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream.",
                "date": "2021-02-11",
                "rating": 3
            },
            {
                "author": "Victor",
                "text": "cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat",
                "date": "2020-07-02",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2021-07-12",
                "rating": 4
            }
        ],
        "averageRating": 3.5
    },
    {
        "name": "ADIDAS",
        "category": "T-shirt",
        "price": 25.99,
        "image": "https://contents.mediadecathlon.com/p2518269/k$ff9fdba7aa03ac53f2571a812fbfa360/sq/adidas-t-shirt-damen-vibaop-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 60,
        "colors": [
            "Black",
            "White",
            "Blue"
        ],
        "sizes": [
            "M",
            "S"
        ],
        "description": "Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch. Chew iPad power cord soft kitty warm",
        "numReviews": 1,
        "reviews": [
            {
                "author": "Eve",
                "text": "amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake",
                "date": "2020-06-13",
                "rating": 3
            }
        ],
        "averageRating": 3.0
    },
    {
        "name": "PUMA",
        "category": "T-shirt",
        "price": 40.99,
        "image": "https://contents.mediadecathlon.com/p2473079/k$18c17edb0d0fcf9503a395a657dbb64a/sq/puma-t-shirt-herren-baumwolle-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 14,
        "colors": [
            "Red",
            "White",
            "Green"
        ],
        "sizes": [
            "XL",
            "L",
            "S"
        ],
        "description": "Purr sleep on your face destroy the blinds. Jump around on couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted",
        "numReviews": 19,
        "reviews": [
            {
                "author": "Ömer",
                "text": "bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart",
                "date": "2020-06-28",
                "rating": 3
            },
            {
                "author": "Oscar",
                "text": "liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread.",
                "date": "2021-08-27",
                "rating": 5
            },
            {
                "author": "Bob",
                "text": "tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie",
                "date": "2020-03-13",
                "rating": 5
            },
            {
                "author": "Ömer",
                "text": "Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I",
                "date": "2020-09-12",
                "rating": 3
            },
            {
                "author": "Judy",
                "text": "love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love",
                "date": "2022-08-20",
                "rating": 5
            },
            {
                "author": "Alice",
                "text": "lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot",
                "date": "2021-10-20",
                "rating": 5
            },
            {
                "author": "Alice",
                "text": "sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow",
                "date": "2023-04-09",
                "rating": 4
            },
            {
                "author": "Grace",
                "text": "I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly",
                "date": "2020-04-19",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream.",
                "date": "2021-02-05",
                "rating": 5
            },
            {
                "author": "Andreea",
                "text": "love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly",
                "date": "2021-04-22",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy",
                "date": "2020-11-05",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice",
                "date": "2023-03-02",
                "rating": 3
            },
            {
                "author": "Heidi",
                "text": "I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop.",
                "date": "2020-04-10",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish.",
                "date": "2022-07-27",
                "rating": 3
            },
            {
                "author": "Wendy",
                "text": "soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll",
                "date": "2021-12-12",
                "rating": 5
            },
            {
                "author": "Nia",
                "text": "brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake",
                "date": "2023-11-29",
                "rating": 3
            },
            {
                "author": "Victor",
                "text": "sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice",
                "date": "2022-05-20",
                "rating": 4
            },
            {
                "author": "Judy",
                "text": "brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels",
                "date": "2022-04-28",
                "rating": 3
            },
            {
                "author": "Trudy",
                "text": "Cupcake ipsum dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love",
                "date": "2023-06-07",
                "rating": 4
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "NEWLINE",
        "category": "T-shirt",
        "price": 35.99,
        "image": "https://contents.mediadecathlon.com/m14411222/k$c2094cc84f160b0e668a9612e1b2cb88/sq/core-functional-t-shirt-herren-laufen-mit-recyceltes-polyester.jpg?format=auto&f=969x969",
        "countInStock": 64,
        "colors": [
            "Red",
            "Blue",
            "Green",
            "White",
            "Black"
        ],
        "sizes": [
            "XL"
        ],
        "description": "on couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot.",
        "numReviews": 16,
        "reviews": [
            {
                "author": "Eve",
                "text": "snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow",
                "date": "2023-04-28",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy",
                "date": "2021-07-12",
                "rating": 5
            },
            {
                "author": "Ömer",
                "text": "candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow",
                "date": "2022-07-07",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop.",
                "date": "2023-01-29",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding",
                "date": "2021-10-19",
                "rating": 5
            },
            {
                "author": "Ivan",
                "text": "lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit",
                "date": "2024-01-07",
                "rating": 3
            },
            {
                "author": "Wendy",
                "text": "jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry",
                "date": "2022-01-18",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread",
                "date": "2022-08-04",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum",
                "date": "2023-06-25",
                "rating": 4
            },
            {
                "author": "Bob",
                "text": "cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake",
                "date": "2021-01-28",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding",
                "date": "2023-04-23",
                "rating": 3
            },
            {
                "author": "Mallory",
                "text": "gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu",
                "date": "2020-12-05",
                "rating": 4
            },
            {
                "author": "Pat",
                "text": "Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2020-06-14",
                "rating": 5
            },
            {
                "author": "Ömer",
                "text": "cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu",
                "date": "2023-10-29",
                "rating": 3
            },
            {
                "author": "Heidi",
                "text": "pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar",
                "date": "2021-10-02",
                "rating": 3
            },
            {
                "author": "Pat",
                "text": "carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop",
                "date": "2021-02-16",
                "rating": 5
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "ADIDAS",
        "category": "T-shirt",
        "price": 45.99,
        "image": "https://contents.mediadecathlon.com/p1949471/k$364209fd43ff54e7f180ac1e28919407/sq/adidas-t-shirt-damen-weiss.jpg?format=auto&f=969x969",
        "countInStock": 46,
        "colors": [
            "Green",
            "White",
            "Blue",
            "Red",
            "Black"
        ],
        "sizes": [
            "XL",
            "L"
        ],
        "description": "is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate",
        "numReviews": 1,
        "reviews": [
            {
                "author": "Nia",
                "text": "biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread",
                "date": "2021-05-19",
                "rating": 5
            }
        ],
        "averageRating": 5.0
    },
    {
        "name": "ADIDAS",
        "category": "Shorts",
        "price": 50.99,
        "image": "https://contents.mediadecathlon.com/p2232681/k$44e5b05a708151d5781a6c35f24a2803/sq/fussballhose-kurz-entrada-22-damenherren-schwarz-adidas.jpg?format=auto&f=969x969",
        "countInStock": 55,
        "colors": [
            "Green",
            "Black"
        ],
        "sizes": [
            "L"
        ],
        "description": "meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red",
        "numReviews": 1,
        "reviews": [
            {
                "author": "Victor",
                "text": "apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut",
                "date": "2024-02-05",
                "rating": 4
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "VAN RYSEL",
        "category": "Shorts",
        "price": 25.99,
        "image": "https://contents.mediadecathlon.com/p2464640/k$2128155f26c4de31847d8b9794c801c4/sq/radhose-kurz-ohne-trager-rc-100-herren-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 43,
        "colors": [
            "White",
            "Blue",
            "Green",
            "Black",
            "Red"
        ],
        "sizes": [
            "XL"
        ],
        "description": "love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch. Chew iPad power cord soft kitty warm kitty little ball",
        "numReviews": 16,
        "reviews": [
            {
                "author": "Randy",
                "text": "jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping.",
                "date": "2021-03-09",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie",
                "date": "2022-05-12",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake",
                "date": "2021-09-10",
                "rating": 3
            },
            {
                "author": "Judy",
                "text": "I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes",
                "date": "2021-06-09",
                "rating": 5
            },
            {
                "author": "Ömer",
                "text": "sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake.",
                "date": "2022-03-18",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie",
                "date": "2022-10-12",
                "rating": 5
            },
            {
                "author": "Victor",
                "text": "love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat",
                "date": "2021-11-12",
                "rating": 5
            },
            {
                "author": "Charlie",
                "text": "pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread",
                "date": "2022-03-30",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie",
                "date": "2022-08-27",
                "rating": 3
            },
            {
                "author": "Kim",
                "text": "roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2021-11-26",
                "rating": 5
            },
            {
                "author": "Mallory",
                "text": "Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream.",
                "date": "2020-08-01",
                "rating": 3
            },
            {
                "author": "Grace",
                "text": "danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread",
                "date": "2021-04-26",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar",
                "date": "2022-09-02",
                "rating": 3
            },
            {
                "author": "Trudy",
                "text": "cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart",
                "date": "2022-05-19",
                "rating": 4
            },
            {
                "author": "Judy",
                "text": "cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread.",
                "date": "2022-12-16",
                "rating": 5
            },
            {
                "author": "Grace",
                "text": "Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut",
                "date": "2022-09-26",
                "rating": 4
            }
        ],
        "averageRating": 4.1
    },
    {
        "name": "KIPSTA",
        "category": "Shorts",
        "price": 54.99,
        "image": "https://contents.mediadecathlon.com/p1988733/k$88cab28e99bcd0d1dcc9d0176a67e2a2/sq/kinder-torwarthose-kurz-f100-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 0,
        "colors": [
            "Blue"
        ],
        "sizes": [
            "XL",
            "S"
        ],
        "description": "your face destroy the blinds. Jump around on couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing",
        "numReviews": 19,
        "reviews": [
            {
                "author": "Heidi",
                "text": "cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread",
                "date": "2021-09-09",
                "rating": 4
            },
            {
                "author": "Pat",
                "text": "I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar",
                "date": "2023-02-12",
                "rating": 4
            },
            {
                "author": "Victor",
                "text": "Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes",
                "date": "2023-06-03",
                "rating": 3
            },
            {
                "author": "Ivan",
                "text": "ipsum dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love",
                "date": "2023-08-20",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton",
                "date": "2023-02-04",
                "rating": 3
            },
            {
                "author": "Grace",
                "text": "plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop",
                "date": "2020-10-05",
                "rating": 4
            },
            {
                "author": "Bob",
                "text": "biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes",
                "date": "2021-08-10",
                "rating": 3
            },
            {
                "author": "Bob",
                "text": "pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread",
                "date": "2021-03-11",
                "rating": 4
            },
            {
                "author": "Victor",
                "text": "biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet",
                "date": "2023-03-24",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat",
                "date": "2022-07-19",
                "rating": 3
            },
            {
                "author": "Eve",
                "text": "cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice",
                "date": "2023-09-30",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly",
                "date": "2021-09-13",
                "rating": 5
            },
            {
                "author": "Eve",
                "text": "candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2020-10-18",
                "rating": 3
            },
            {
                "author": "Oscar",
                "text": "ipsum dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar",
                "date": "2021-02-06",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice",
                "date": "2020-06-18",
                "rating": 4
            },
            {
                "author": "Barış",
                "text": "I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu",
                "date": "2022-03-21",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu",
                "date": "2020-12-24",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy",
                "date": "2022-07-12",
                "rating": 5
            },
            {
                "author": "Grace",
                "text": "candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels",
                "date": "2021-07-21",
                "rating": 4
            }
        ],
        "averageRating": 3.8
    },
    {
        "name": "ROCKRIDER",
        "category": "Shorts",
        "price": 30.99,
        "image": "https://contents.mediadecathlon.com/p2490944/k$95409e4d56d1ece7b3e2cece768c5bbc/sq/herren-mtb-short-kurze-radhose-expl-100-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 7,
        "colors": [
            "Red",
            "Black"
        ],
        "sizes": [
            "M",
            "S"
        ],
        "description": "chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for",
        "numReviews": 13,
        "reviews": [
            {
                "author": "Alice",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I",
                "date": "2022-06-02",
                "rating": 4
            },
            {
                "author": "Bob",
                "text": "brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love",
                "date": "2021-12-23",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop.",
                "date": "2020-05-09",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I",
                "date": "2023-07-05",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie",
                "date": "2023-01-25",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie",
                "date": "2023-09-03",
                "rating": 5
            },
            {
                "author": "Judy",
                "text": "snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love",
                "date": "2023-06-09",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes",
                "date": "2020-10-30",
                "rating": 3
            },
            {
                "author": "Judy",
                "text": "lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I",
                "date": "2021-05-19",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie",
                "date": "2020-05-30",
                "rating": 3
            },
            {
                "author": "Eve",
                "text": "brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread",
                "date": "2022-06-28",
                "rating": 3
            },
            {
                "author": "Quincy",
                "text": "liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy",
                "date": "2020-02-14",
                "rating": 3
            },
            {
                "author": "Bob",
                "text": "sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I",
                "date": "2022-06-01",
                "rating": 3
            }
        ],
        "averageRating": 3.7
    },
    {
        "name": "ROCKRIDER",
        "category": "Shorts",
        "price": 20.99,
        "image": "https://contents.mediadecathlon.com/p2490865/k$1f095e36f68618bd08b67503ea684b10/sq/radhose-kurz-mtb-expl-500-herren-2-in-1-radsport-innenhose-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 16,
        "colors": [
            "Black",
            "Blue",
            "Red",
            "Green",
            "White"
        ],
        "sizes": [
            "S",
            "L",
            "XL"
        ],
        "description": "pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch.",
        "numReviews": 1,
        "reviews": [
            {
                "author": "Quincy",
                "text": "jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread",
                "date": "2021-09-27",
                "rating": 4
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "WEDZE",
        "category": "Schneeanzug",
        "price": 95.99,
        "image": "https://contents.mediadecathlon.com/p2598755/k$473abb24ed74ffb7228c68b6ad320596/sq/schneeanzug-skianzug-kinder-warm-wasserdicht-500-rosablau.jpg?format=auto&f=969x969",
        "countInStock": 35,
        "colors": [
            "Green",
            "Red",
            "White",
            "Black"
        ],
        "sizes": [
            "M"
        ],
        "description": "is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles",
        "numReviews": 6,
        "reviews": [
            {
                "author": "Andreea",
                "text": "ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon",
                "date": "2021-05-01",
                "rating": 4
            },
            {
                "author": "Dave",
                "text": "tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2022-03-07",
                "rating": 4
            },
            {
                "author": "Barış",
                "text": "chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie",
                "date": "2022-03-26",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2022-12-09",
                "rating": 3
            },
            {
                "author": "Trudy",
                "text": "cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow",
                "date": "2021-08-16",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly",
                "date": "2020-04-11",
                "rating": 3
            }
        ],
        "averageRating": 3.7
    },
    {
        "name": "DECATHLON",
        "category": "Sportschuhe",
        "price": 50.99,
        "image": "https://contents.mediadecathlon.com/p1867979/k$76bf92fc67a6e03cbbf5bbaac894c668/sq/sportschuhe-kinder-klettverschluss-wasserdicht-strapazierfahig-resist.jpg?format=auto&f=969x969",
        "countInStock": 61,
        "colors": [
            "Black",
            "White",
            "Blue",
            "Red",
            "Green"
        ],
        "sizes": [
            "M",
            "L",
            "XL"
        ],
        "description": "hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I",
        "numReviews": 11,
        "reviews": [
            {
                "author": "Kim",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread",
                "date": "2022-07-21",
                "rating": 4
            },
            {
                "author": "Bob",
                "text": "jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow",
                "date": "2022-03-20",
                "rating": 3
            },
            {
                "author": "Bob",
                "text": "sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie",
                "date": "2020-12-28",
                "rating": 4
            },
            {
                "author": "Dave",
                "text": "jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton",
                "date": "2023-09-16",
                "rating": 4
            },
            {
                "author": "Charlie",
                "text": "pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love",
                "date": "2020-05-16",
                "rating": 4
            },
            {
                "author": "Nia",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake",
                "date": "2021-07-27",
                "rating": 3
            },
            {
                "author": "Wendy",
                "text": "jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet",
                "date": "2022-11-12",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie",
                "date": "2023-06-21",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly",
                "date": "2020-03-20",
                "rating": 5
            },
            {
                "author": "Sybil",
                "text": "cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice",
                "date": "2020-10-15",
                "rating": 4
            },
            {
                "author": "Oscar",
                "text": "chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o",
                "date": "2020-03-11",
                "rating": 3
            }
        ],
        "averageRating": 3.8
    },
    {
        "name": "WEDZE",
        "category": "Skijacke",
        "price": 50.99,
        "image": "https://contents.mediadecathlon.com/p2583897/k$636f77bebd4c2e831033dc699bcc0067/sq/skijacke-kinder-warm-wasserdicht-550-blau.jpg?format=auto&f=969x969",
        "countInStock": 85,
        "colors": [
            "Green",
            "Blue",
            "Red"
        ],
        "sizes": [
            "L"
        ],
        "description": "blinds. Jump around on couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet",
        "numReviews": 4,
        "reviews": [
            {
                "author": "Judy",
                "text": "marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I",
                "date": "2020-09-16",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice",
                "date": "2020-08-23",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2022-10-16",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon",
                "date": "2022-07-09",
                "rating": 5
            }
        ],
        "averageRating": 4.2
    },
    {
        "name": "WEDZE",
        "category": "Skihose",
        "price": 20.99,
        "image": "https://contents.mediadecathlon.com/p2579904/k$492ab2201f65a3511de94bd994b87f99/sq/skihose-warm-wasserdicht-100-kinder-neonrosa.jpg?format=auto&f=969x969",
        "countInStock": 47,
        "colors": [
            "Black",
            "Green",
            "White",
            "Red"
        ],
        "sizes": [
            "XL",
            "M",
            "L",
            "S"
        ],
        "description": "pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase",
        "numReviews": 7,
        "reviews": [
            {
                "author": "Ömer",
                "text": "cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding",
                "date": "2021-11-17",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé",
                "date": "2021-03-10",
                "rating": 5
            },
            {
                "author": "Heidi",
                "text": "snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit",
                "date": "2020-01-04",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love",
                "date": "2023-08-25",
                "rating": 5
            },
            {
                "author": "Charlie",
                "text": "sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate",
                "date": "2020-07-12",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum",
                "date": "2023-02-21",
                "rating": 3
            },
            {
                "author": "Dave",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes",
                "date": "2020-05-09",
                "rating": 5
            }
        ],
        "averageRating": 4.3
    },
    {
        "name": "WEDZE",
        "category": "Skibrille",
        "price": 55.99,
        "image": "https://contents.mediadecathlon.com/p2576945/k$32b2599d5e38124e5ee95d3b819d6681/sq/skibrille-snowboardbrille-erwachsenekinder-allwetter-g-500-i-grau.jpg?format=auto&f=969x969",
        "countInStock": 65,
        "colors": [
            "Black",
            "Red"
        ],
        "sizes": [
            "XL"
        ],
        "description": "meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get",
        "numReviews": 9,
        "reviews": [
            {
                "author": "Randy",
                "text": "bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread",
                "date": "2021-09-21",
                "rating": 4
            },
            {
                "author": "Barış",
                "text": "ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I",
                "date": "2021-02-28",
                "rating": 3
            },
            {
                "author": "Randy",
                "text": "love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps",
                "date": "2020-04-25",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "Cupcake ipsum dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate",
                "date": "2021-04-28",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton",
                "date": "2021-09-22",
                "rating": 3
            },
            {
                "author": "Victor",
                "text": "carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2020-05-27",
                "rating": 5
            },
            {
                "author": "Andreea",
                "text": "bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice",
                "date": "2020-09-18",
                "rating": 4
            },
            {
                "author": "Pat",
                "text": "lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I",
                "date": "2020-08-10",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love",
                "date": "2021-07-30",
                "rating": 5
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "DREAMSCAPE",
        "category": "Rückenprotektor Ski",
        "price": 65.99,
        "image": "https://contents.mediadecathlon.com/p2598966/k$261e05a2209b76268de8ce15bc58fc5c/sq/ruckenprotektor-ski-snowboard-kinder-dbck-500-orange.jpg?format=auto&f=969x969",
        "countInStock": 54,
        "colors": [
            "Red",
            "White"
        ],
        "sizes": [
            "S",
            "L",
            "M"
        ],
        "description": "moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at",
        "numReviews": 2,
        "reviews": [
            {
                "author": "Ömer",
                "text": "jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love",
                "date": "2021-06-06",
                "rating": 4
            },
            {
                "author": "Judy",
                "text": "shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer",
                "date": "2021-01-09",
                "rating": 4
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "TUNTURI",
        "category": "Hanteln",
        "price": 70.99,
        "image": "https://contents.mediadecathlon.com/m13368030/k$77e1ebc8dabdc680c5359fb12605f5b4/sq/kurzhantelset-6-x-kurze-hanteln-mit-20-kg.jpg?format=auto&f=969x969",
        "countInStock": 15,
        "colors": [
            "Blue",
            "Red",
            "Black",
            "Green"
        ],
        "sizes": [
            "XL",
            "M",
            "L"
        ],
        "description": "now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot",
        "numReviews": 8,
        "reviews": [
            {
                "author": "Quincy",
                "text": "tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps",
                "date": "2020-07-29",
                "rating": 5
            },
            {
                "author": "Nia",
                "text": "pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop",
                "date": "2022-08-02",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes",
                "date": "2024-02-06",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll",
                "date": "2020-05-04",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love",
                "date": "2021-05-17",
                "rating": 3
            },
            {
                "author": "Dave",
                "text": "candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake",
                "date": "2023-12-30",
                "rating": 3
            },
            {
                "author": "Charlie",
                "text": "shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake.",
                "date": "2021-03-15",
                "rating": 4
            },
            {
                "author": "Nia",
                "text": "cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie",
                "date": "2024-02-03",
                "rating": 5
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "CHRISTOPEIT",
        "category": "Hanteln",
        "price": 20.99,
        "image": "https://contents.mediadecathlon.com/m1028771/k$b70239067b8f2fac420aa3171e4b4745/sq/christopeit-hanteln-2-x-3-kg.jpg?format=auto&f=969x969",
        "countInStock": 34,
        "colors": [
            "Green"
        ],
        "sizes": [
            "XL"
        ],
        "description": "the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog",
        "numReviews": 3,
        "reviews": [
            {
                "author": "Nia",
                "text": "pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie",
                "date": "2023-02-26",
                "rating": 3
            },
            {
                "author": "Frank",
                "text": "cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé",
                "date": "2020-09-20",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut",
                "date": "2021-08-04",
                "rating": 5
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "CORENGTH",
        "category": "Hanteln",
        "price": 55.99,
        "image": "https://contents.mediadecathlon.com/p2174842/k$7694ff37ee8fe79f8b7aa594743a3b2f/sq/hantel-15-kg-crosstraining-krafttraining-hex-dumbbell-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 78,
        "colors": [
            "Green"
        ],
        "sizes": [
            "M",
            "L"
        ],
        "description": "hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing",
        "numReviews": 13,
        "reviews": [
            {
                "author": "Victor",
                "text": "tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels",
                "date": "2021-06-13",
                "rating": 5
            },
            {
                "author": "Barış",
                "text": "tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake",
                "date": "2022-06-21",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I",
                "date": "2020-03-23",
                "rating": 5
            },
            {
                "author": "Grace",
                "text": "marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut",
                "date": "2023-07-03",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2024-01-26",
                "rating": 3
            },
            {
                "author": "Pat",
                "text": "pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2023-12-01",
                "rating": 3
            },
            {
                "author": "Trudy",
                "text": "jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry",
                "date": "2021-03-20",
                "rating": 3
            },
            {
                "author": "Kim",
                "text": "donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding sweet",
                "date": "2021-04-03",
                "rating": 3
            },
            {
                "author": "Heidi",
                "text": "jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie",
                "date": "2023-04-14",
                "rating": 5
            },
            {
                "author": "Heidi",
                "text": "jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love",
                "date": "2021-11-23",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2023-05-08",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I",
                "date": "2023-08-08",
                "rating": 5
            },
            {
                "author": "Oscar",
                "text": "chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice",
                "date": "2021-11-09",
                "rating": 5
            }
        ],
        "averageRating": 4.1
    },
    {
        "name": "MATCHU SPORTS",
        "category": "Hanteln",
        "price": 160.99,
        "image": "https://contents.mediadecathlon.com/m2664830/k$75109313446b2454516642a52642a8b7/sq/hantel-hex-dumbbell-20-kg-mit-gummigriff.jpg?format=auto&f=969x969",
        "countInStock": 93,
        "colors": [
            "Red",
            "White"
        ],
        "sizes": [
            "XL",
            "L",
            "M"
        ],
        "description": "anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at",
        "numReviews": 8,
        "reviews": [
            {
                "author": "Dave",
                "text": "brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I",
                "date": "2020-10-14",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake",
                "date": "2021-05-04",
                "rating": 3
            },
            {
                "author": "Ömer",
                "text": "candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu",
                "date": "2022-12-28",
                "rating": 3
            },
            {
                "author": "Judy",
                "text": "sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake",
                "date": "2022-07-27",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o",
                "date": "2022-07-07",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2022-10-20",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut",
                "date": "2020-06-30",
                "rating": 5
            },
            {
                "author": "Andreea",
                "text": "love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly",
                "date": "2022-07-05",
                "rating": 5
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "MUSCLE POWER",
        "category": "Hanteln",
        "price": 40.99,
        "image": "https://contents.mediadecathlon.com/m3906207/k$0dfb1c716a0c5d5a92c9fe5a86d04936/sq/hexa-hantel-pro-stuck.jpg?format=auto&f=969x969",
        "countInStock": 39,
        "colors": [
            "Red",
            "Black"
        ],
        "sizes": [
            "L",
            "S"
        ],
        "description": "couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going",
        "numReviews": 7,
        "reviews": [
            {
                "author": "Ömer",
                "text": "roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet.",
                "date": "2021-03-14",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit",
                "date": "2021-03-27",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet",
                "date": "2023-04-26",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice",
                "date": "2020-07-14",
                "rating": 4
            },
            {
                "author": "Judy",
                "text": "Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum",
                "date": "2020-04-12",
                "rating": 5
            },
            {
                "author": "Sybil",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels",
                "date": "2020-12-10",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love",
                "date": "2023-10-19",
                "rating": 5
            }
        ],
        "averageRating": 4.3
    },
    {
        "name": "CORENGTH",
        "category": "Hanteln",
        "price": 85.99,
        "image": "https://contents.mediadecathlon.com/p2175081/k$8f08c974fb24095b37361ca5a61eee49/sq/hantel-225-kg-crosstraining-krafttraining-hex-dumbbell-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 25,
        "colors": [
            "Blue"
        ],
        "sizes": [
            "XL"
        ],
        "description": "now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot",
        "numReviews": 16,
        "reviews": [
            {
                "author": "Wendy",
                "text": "bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll",
                "date": "2020-12-07",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie",
                "date": "2022-10-12",
                "rating": 4
            },
            {
                "author": "Victor",
                "text": "snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate",
                "date": "2021-10-17",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2023-06-18",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2022-01-05",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish",
                "date": "2021-11-07",
                "rating": 4
            },
            {
                "author": "Dave",
                "text": "cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2023-01-14",
                "rating": 5
            },
            {
                "author": "Dave",
                "text": "love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie",
                "date": "2020-05-22",
                "rating": 3
            },
            {
                "author": "Charlie",
                "text": "Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut",
                "date": "2022-04-25",
                "rating": 4
            },
            {
                "author": "Oscar",
                "text": "soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet",
                "date": "2023-05-01",
                "rating": 3
            },
            {
                "author": "Judy",
                "text": "tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2021-09-06",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate",
                "date": "2022-01-10",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow",
                "date": "2022-02-07",
                "rating": 4
            },
            {
                "author": "Victor",
                "text": "caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I",
                "date": "2021-01-23",
                "rating": 5
            },
            {
                "author": "Kim",
                "text": "jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish.",
                "date": "2023-04-03",
                "rating": 3
            },
            {
                "author": "Pat",
                "text": "chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear",
                "date": "2020-01-26",
                "rating": 5
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "SHAPEVITAL",
        "category": "Springseile",
        "price": 15.99,
        "image": "https://contents.mediadecathlon.com/m9462983/k$f906e2467fa1713077fb106d9d794f0c/sq/springseil-vital-fit-speed-rope-fur-kardio-und-intervalltraining.jpg?format=auto&f=969x969",
        "countInStock": 48,
        "colors": [
            "Black",
            "Red",
            "Green",
            "White"
        ],
        "sizes": [
            "S"
        ],
        "description": "going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch. Chew iPad power cord soft",
        "numReviews": 9,
        "reviews": [
            {
                "author": "Dave",
                "text": "tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly",
                "date": "2020-01-09",
                "rating": 3
            },
            {
                "author": "Eve",
                "text": "Cupcake ipsum dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah",
                "date": "2020-10-11",
                "rating": 4
            },
            {
                "author": "Pat",
                "text": "lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry",
                "date": "2023-01-12",
                "rating": 5
            },
            {
                "author": "Nia",
                "text": "donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2021-09-21",
                "rating": 3
            },
            {
                "author": "Barış",
                "text": "sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly",
                "date": "2022-03-17",
                "rating": 5
            },
            {
                "author": "Dave",
                "text": "caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut",
                "date": "2021-06-26",
                "rating": 3
            },
            {
                "author": "Quincy",
                "text": "snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot",
                "date": "2022-07-19",
                "rating": 3
            },
            {
                "author": "Frank",
                "text": "Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice",
                "date": "2020-02-18",
                "rating": 3
            },
            {
                "author": "Oscar",
                "text": "candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread",
                "date": "2020-07-29",
                "rating": 4
            }
        ],
        "averageRating": 3.7
    },
    {
        "name": "ELITE ATHLETE",
        "category": "Springseile",
        "price": 22.99,
        "image": "https://contents.mediadecathlon.com/m10655946/k$e6ac378a6dc8fb2d1db8d132b01ca6fb/sq/eliteathlete-premium-springseil-herren-damen-speed-rope.jpg?format=auto&f=969x969",
        "countInStock": 56,
        "colors": [
            "Red",
            "Blue",
            "Black",
            "White",
            "Green"
        ],
        "sizes": [
            "M"
        ],
        "description": "iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch. Chew iPad power cord soft kitty warm kitty little ball",
        "numReviews": 12,
        "reviews": [
            {
                "author": "Bob",
                "text": "carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice",
                "date": "2021-11-11",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake",
                "date": "2023-02-28",
                "rating": 3
            },
            {
                "author": "Grace",
                "text": "tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes",
                "date": "2022-09-08",
                "rating": 3
            },
            {
                "author": "Barış",
                "text": "Cupcake ipsum dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake",
                "date": "2022-09-03",
                "rating": 3
            },
            {
                "author": "Barış",
                "text": "donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding sweet",
                "date": "2024-01-30",
                "rating": 5
            },
            {
                "author": "Bob",
                "text": "Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love",
                "date": "2020-07-07",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton",
                "date": "2021-08-24",
                "rating": 5
            },
            {
                "author": "Oscar",
                "text": "halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread.",
                "date": "2020-04-01",
                "rating": 3
            },
            {
                "author": "Quincy",
                "text": "claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish.",
                "date": "2022-11-29",
                "rating": 5
            },
            {
                "author": "Ömer",
                "text": "I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I",
                "date": "2021-08-06",
                "rating": 5
            },
            {
                "author": "Randy",
                "text": "love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding sweet muffin.",
                "date": "2021-03-27",
                "rating": 5
            },
            {
                "author": "Nia",
                "text": "I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love",
                "date": "2021-10-02",
                "rating": 5
            }
        ],
        "averageRating": 4.2
    },
    {
        "name": "NORTHWALL",
        "category": "Springseile",
        "price": 36.99,
        "image": "https://contents.mediadecathlon.com/m6819991/k$32c0c69f249a012cddf4fdcc75becb7d/sq/northwall-s1-verstellbares-springseil.jpg?format=auto&f=969x969",
        "countInStock": 14,
        "colors": [
            "Black",
            "White"
        ],
        "sizes": [
            "XL"
        ],
        "description": "couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted",
        "numReviews": 20,
        "reviews": [
            {
                "author": "Victor",
                "text": "brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2021-04-28",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I",
                "date": "2020-04-07",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate",
                "date": "2020-11-28",
                "rating": 5
            },
            {
                "author": "Frank",
                "text": "pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2022-06-08",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly",
                "date": "2023-02-26",
                "rating": 4
            },
            {
                "author": "Dave",
                "text": "Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut",
                "date": "2020-06-18",
                "rating": 3
            },
            {
                "author": "Judy",
                "text": "jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop.",
                "date": "2024-02-08",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut",
                "date": "2020-07-14",
                "rating": 5
            },
            {
                "author": "Victor",
                "text": "Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear",
                "date": "2020-08-29",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes",
                "date": "2023-03-12",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I",
                "date": "2021-11-23",
                "rating": 5
            },
            {
                "author": "Quincy",
                "text": "halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot",
                "date": "2022-11-12",
                "rating": 3
            },
            {
                "author": "Judy",
                "text": "sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet.",
                "date": "2023-10-04",
                "rating": 3
            },
            {
                "author": "Frank",
                "text": "candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice",
                "date": "2021-05-04",
                "rating": 3
            },
            {
                "author": "Sybil",
                "text": "snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread.",
                "date": "2023-08-18",
                "rating": 3
            },
            {
                "author": "Ömer",
                "text": "I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame",
                "date": "2021-07-14",
                "rating": 5
            },
            {
                "author": "Oscar",
                "text": "cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie",
                "date": "2020-10-24",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut",
                "date": "2023-02-25",
                "rating": 5
            },
            {
                "author": "Pat",
                "text": "gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee",
                "date": "2022-04-10",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish.",
                "date": "2020-03-05",
                "rating": 4
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "TUNTURI",
        "category": "Springseile",
        "price": 40.99,
        "image": "https://contents.mediadecathlon.com/m14952334/k$a0f4f5518fd318d4139476aa2924e70b/sq/verstellbares-springseil-pro-speed-rope-3m-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 60,
        "colors": [
            "White",
            "Green"
        ],
        "sizes": [
            "XL",
            "L"
        ],
        "description": "now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot",
        "numReviews": 0,
        "reviews": [],
        "averageRating": 0
    },
    {
        "name": "VIA FORTIS",
        "category": "Springseile",
        "price": 25.99,
        "image": "https://contents.mediadecathlon.com/m2457363/k$9324329ed109b05fb612a6e2aa894e4d/sq/profi-springseil-mit-gewichten-langenverstellbar-mit-tasche-and-ersatzseil.jpg?format=auto&f=969x969",
        "countInStock": 16,
        "colors": [
            "White",
            "Blue",
            "Red",
            "Green"
        ],
        "sizes": [
            "XL",
            "S",
            "L"
        ],
        "description": "Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch. Chew iPad power cord",
        "numReviews": 19,
        "reviews": [
            {
                "author": "Randy",
                "text": "sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake",
                "date": "2020-08-09",
                "rating": 3
            },
            {
                "author": "Charlie",
                "text": "cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie",
                "date": "2020-01-31",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate",
                "date": "2022-06-08",
                "rating": 3
            },
            {
                "author": "Wendy",
                "text": "candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love",
                "date": "2023-07-05",
                "rating": 5
            },
            {
                "author": "Eve",
                "text": "cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake",
                "date": "2021-07-06",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread.",
                "date": "2021-11-11",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow",
                "date": "2024-01-21",
                "rating": 3
            },
            {
                "author": "Eve",
                "text": "jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread",
                "date": "2020-07-17",
                "rating": 5
            },
            {
                "author": "Kim",
                "text": "pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow",
                "date": "2020-06-23",
                "rating": 4
            },
            {
                "author": "Nia",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love",
                "date": "2020-03-17",
                "rating": 4
            },
            {
                "author": "Oscar",
                "text": "sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw.",
                "date": "2021-07-20",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream.",
                "date": "2020-09-16",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton",
                "date": "2020-05-12",
                "rating": 4
            },
            {
                "author": "Grace",
                "text": "cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame",
                "date": "2021-10-13",
                "rating": 4
            },
            {
                "author": "Judy",
                "text": "donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2021-01-01",
                "rating": 3
            },
            {
                "author": "Alice",
                "text": "candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love",
                "date": "2022-09-15",
                "rating": 3
            },
            {
                "author": "Barış",
                "text": "bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie",
                "date": "2022-12-13",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding",
                "date": "2021-01-17",
                "rating": 4
            },
            {
                "author": "Judy",
                "text": "chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie",
                "date": "2023-03-13",
                "rating": 4
            }
        ],
        "averageRating": 3.8
    },
    {
        "name": "REUSCH",
        "category": "Skihandschuhe",
        "price": 40.99,
        "image": "https://contents.mediadecathlon.com/p2528845/k$927e6f1741e716528b75cee31918923f/sq/skihandschuhe-herren-gore-tex-reusch-snow-spirit.jpg?format=auto&f=969x969",
        "countInStock": 20,
        "colors": [
            "Blue"
        ],
        "sizes": [
            "XL",
            "S",
            "L",
            "M"
        ],
        "description": "given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your",
        "numReviews": 11,
        "reviews": [
            {
                "author": "Quincy",
                "text": "I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love",
                "date": "2022-06-12",
                "rating": 4
            },
            {
                "author": "Charlie",
                "text": "danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love",
                "date": "2020-07-01",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice",
                "date": "2022-06-12",
                "rating": 5
            },
            {
                "author": "Charlie",
                "text": "Cupcake ipsum dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé",
                "date": "2020-09-03",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding sweet muffin.",
                "date": "2020-04-10",
                "rating": 3
            },
            {
                "author": "Barış",
                "text": "cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee",
                "date": "2021-12-02",
                "rating": 3
            },
            {
                "author": "Charlie",
                "text": "love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry",
                "date": "2023-05-11",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie",
                "date": "2022-09-23",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2023-11-20",
                "rating": 3
            },
            {
                "author": "Judy",
                "text": "cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer",
                "date": "2020-12-28",
                "rating": 4
            },
            {
                "author": "Barış",
                "text": "cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly",
                "date": "2020-05-04",
                "rating": 3
            }
        ],
        "averageRating": 3.7
    },
    {
        "name": "REUSCH",
        "category": "Handschuhe",
        "price": 33.99,
        "image": "https://contents.mediadecathlon.com/m4450099/k$26bc8ff8177032331a095d5065a667d8/sq/reusch-handschuhe-multisport-glove-gore-tex-infinium.jpg?format=auto&f=969x969",
        "countInStock": 30,
        "colors": [
            "Red",
            "White",
            "Black",
            "Green"
        ],
        "sizes": [
            "S"
        ],
        "description": "internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch. Chew",
        "numReviews": 4,
        "reviews": [
            {
                "author": "Pat",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton",
                "date": "2024-01-08",
                "rating": 5
            },
            {
                "author": "Bob",
                "text": "biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll",
                "date": "2022-05-02",
                "rating": 5
            },
            {
                "author": "Pat",
                "text": "chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding sweet muffin.",
                "date": "2021-04-17",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream.",
                "date": "2023-06-17",
                "rating": 4
            }
        ],
        "averageRating": 4.5
    },
    {
        "name": "SOLOGNAC",
        "category": "Jagdhandschuhe",
        "price": 30.99,
        "image": "https://contents.mediadecathlon.com/p1902371/k$642d82c2934c4da77c826ab2a971d8c0/sq/jagdhandschuhe-faustlinge-900-warm.jpg?format=auto&f=969x969",
        "countInStock": 58,
        "colors": [
            "Blue",
            "White",
            "Green",
            "Black"
        ],
        "sizes": [
            "M",
            "S",
            "L"
        ],
        "description": "pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot",
        "numReviews": 5,
        "reviews": [
            {
                "author": "Bob",
                "text": "chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2022-01-17",
                "rating": 5
            },
            {
                "author": "Frank",
                "text": "jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu",
                "date": "2023-01-17",
                "rating": 5
            },
            {
                "author": "Charlie",
                "text": "candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton",
                "date": "2024-01-25",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread",
                "date": "2022-11-20",
                "rating": 3
            },
            {
                "author": "Eve",
                "text": "amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé",
                "date": "2022-12-17",
                "rating": 3
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "WEDZE",
        "category": "Skihandschuhe ",
        "price": 40.99,
        "image": "https://contents.mediadecathlon.com/p2579055/k$cd6b61f0c2119aeddf83e56090318991/sq/skihandschuhe-kinder-warm-wasserdicht-900-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 98,
        "colors": [
            "White",
            "Blue",
            "Red"
        ],
        "sizes": [
            "S",
            "M",
            "XL",
            "L"
        ],
        "description": "Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare",
        "numReviews": 14,
        "reviews": [
            {
                "author": "Nia",
                "text": "fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer",
                "date": "2023-01-17",
                "rating": 3
            },
            {
                "author": "Bob",
                "text": "pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet",
                "date": "2020-04-04",
                "rating": 5
            },
            {
                "author": "Quincy",
                "text": "jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream.",
                "date": "2022-10-02",
                "rating": 3
            },
            {
                "author": "Ömer",
                "text": "lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton",
                "date": "2022-05-14",
                "rating": 4
            },
            {
                "author": "Judy",
                "text": "cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut",
                "date": "2021-05-12",
                "rating": 4
            },
            {
                "author": "Barış",
                "text": "Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o",
                "date": "2021-01-30",
                "rating": 5
            },
            {
                "author": "Barış",
                "text": "pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o",
                "date": "2021-03-20",
                "rating": 3
            },
            {
                "author": "Barış",
                "text": "sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry",
                "date": "2021-09-10",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I",
                "date": "2021-01-21",
                "rating": 4
            },
            {
                "author": "Nia",
                "text": "I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly",
                "date": "2020-07-26",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream.",
                "date": "2021-02-27",
                "rating": 5
            },
            {
                "author": "Pat",
                "text": "chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly",
                "date": "2020-11-19",
                "rating": 3
            },
            {
                "author": "Sybil",
                "text": "cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy",
                "date": "2022-11-09",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé",
                "date": "2021-07-10",
                "rating": 4
            }
        ],
        "averageRating": 3.9
    },
    {
        "name": "WEDZE",
        "category": "Skihandschuhe",
        "price": 60.99,
        "image": "https://contents.mediadecathlon.com/p2579333/k$212a9df773ff9a49d355ecd344368778/sq/skihandschuhe-erwachsene-freeride-900-braunschwarz.jpg?format=auto&f=969x969",
        "countInStock": 15,
        "colors": [
            "White"
        ],
        "sizes": [
            "S",
            "M",
            "L"
        ],
        "description": "is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice",
        "numReviews": 17,
        "reviews": [
            {
                "author": "Judy",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o",
                "date": "2023-12-27",
                "rating": 5
            },
            {
                "author": "Trudy",
                "text": "ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly",
                "date": "2022-10-10",
                "rating": 3
            },
            {
                "author": "Mallory",
                "text": "chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding sweet muffin.",
                "date": "2022-02-04",
                "rating": 5
            },
            {
                "author": "Wendy",
                "text": "gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love",
                "date": "2022-03-24",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate",
                "date": "2020-10-05",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop",
                "date": "2024-01-09",
                "rating": 3
            },
            {
                "author": "Judy",
                "text": "plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream.",
                "date": "2023-04-02",
                "rating": 5
            },
            {
                "author": "Eve",
                "text": "fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer",
                "date": "2021-12-06",
                "rating": 5
            },
            {
                "author": "Ivan",
                "text": "caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding sweet muffin.",
                "date": "2020-06-29",
                "rating": 5
            },
            {
                "author": "Wendy",
                "text": "sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread",
                "date": "2023-09-09",
                "rating": 5
            },
            {
                "author": "Heidi",
                "text": "carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice",
                "date": "2022-03-20",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding sweet muffin.",
                "date": "2020-04-17",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o",
                "date": "2021-03-22",
                "rating": 3
            },
            {
                "author": "Alice",
                "text": "love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake",
                "date": "2021-01-29",
                "rating": 5
            },
            {
                "author": "Andreea",
                "text": "sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2020-04-11",
                "rating": 4
            },
            {
                "author": "Nia",
                "text": "I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I",
                "date": "2020-09-01",
                "rating": 4
            },
            {
                "author": "Barış",
                "text": "Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2020-08-23",
                "rating": 3
            }
        ],
        "averageRating": 4.2
    },
    {
        "name": "FOUGANZA",
        "category": "Reithandschuhe",
        "price": 30.99,
        "image": "https://contents.mediadecathlon.com/p2490367/k$e474981cc944a1395f8ca86b4077a183/sq/reithandschuhe-classic-leder-damenherren-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 80,
        "colors": [
            "White",
            "Green",
            "Black"
        ],
        "sizes": [
            "L"
        ],
        "description": "sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to",
        "numReviews": 15,
        "reviews": [
            {
                "author": "Barış",
                "text": "jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate",
                "date": "2022-08-12",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat",
                "date": "2021-02-15",
                "rating": 5
            },
            {
                "author": "Frank",
                "text": "jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake.",
                "date": "2020-11-08",
                "rating": 3
            },
            {
                "author": "Andreea",
                "text": "gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate",
                "date": "2020-08-26",
                "rating": 3
            },
            {
                "author": "Grace",
                "text": "apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes",
                "date": "2022-02-07",
                "rating": 4
            },
            {
                "author": "Bob",
                "text": "bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes",
                "date": "2022-10-03",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2022-03-15",
                "rating": 4
            },
            {
                "author": "Bob",
                "text": "chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly",
                "date": "2023-09-11",
                "rating": 3
            },
            {
                "author": "Eve",
                "text": "jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake",
                "date": "2022-07-13",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet.",
                "date": "2022-07-18",
                "rating": 3
            },
            {
                "author": "Andreea",
                "text": "beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut",
                "date": "2022-12-10",
                "rating": 4
            },
            {
                "author": "Dave",
                "text": "cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop.",
                "date": "2021-12-16",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie",
                "date": "2023-01-19",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes",
                "date": "2022-11-09",
                "rating": 3
            },
            {
                "author": "Heidi",
                "text": "apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread",
                "date": "2021-02-24",
                "rating": 4
            }
        ],
        "averageRating": 3.7
    },
    {
        "name": "OPTIMUM NUTRITION",
        "category": "Opti-Men",
        "price": 20.99,
        "image": "https://contents.mediadecathlon.com/m11517931/k$2612c5295ef9de7ad36630818acb798d/sq/opti-men-180tabs-optimum-nutrition.jpg?format=auto&f=969x969",
        "countInStock": 22,
        "colors": [
            "Green",
            "Red",
            "Blue",
            "White",
            "Black"
        ],
        "sizes": [
            "S",
            "XL"
        ],
        "description": "for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun",
        "numReviews": 1,
        "reviews": [
            {
                "author": "Eve",
                "text": "pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love",
                "date": "2023-07-30",
                "rating": 4
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "POWERBAR",
        "category": "Energy-Gel Hydrogel",
        "price": 45.99,
        "image": "https://contents.mediadecathlon.com/p2277809/k$e7abdbba7dcb16f69997d452e0ae71c1/sq/energy-gel-hydrogel-multipack-cola-x24.jpg?format=auto&f=969x969",
        "countInStock": 44,
        "colors": [
            "Green"
        ],
        "sizes": [
            "L",
            "S",
            "M"
        ],
        "description": "imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed",
        "numReviews": 12,
        "reviews": [
            {
                "author": "Ömer",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate",
                "date": "2023-04-23",
                "rating": 3
            },
            {
                "author": "Bob",
                "text": "shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I",
                "date": "2023-08-29",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2023-05-16",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I",
                "date": "2023-11-05",
                "rating": 5
            },
            {
                "author": "Wendy",
                "text": "carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love",
                "date": "2021-10-08",
                "rating": 4
            },
            {
                "author": "Grace",
                "text": "apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps",
                "date": "2021-10-15",
                "rating": 3
            },
            {
                "author": "Eve",
                "text": "topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread",
                "date": "2021-07-05",
                "rating": 4
            },
            {
                "author": "Nia",
                "text": "plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2021-08-31",
                "rating": 3
            },
            {
                "author": "Heidi",
                "text": "pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I",
                "date": "2023-12-04",
                "rating": 4
            },
            {
                "author": "Barış",
                "text": "cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut",
                "date": "2022-07-18",
                "rating": 5
            },
            {
                "author": "Heidi",
                "text": "ipsum dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu.",
                "date": "2021-10-12",
                "rating": 5
            },
            {
                "author": "Pat",
                "text": "pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I",
                "date": "2022-10-31",
                "rating": 5
            }
        ],
        "averageRating": 4.1
    },
    {
        "name": "DOMYOS",
        "category": "Proteinpulver",
        "price": 30.99,
        "image": "https://contents.mediadecathlon.com/p2367921/k$c3ceefdc246a9ed9ae1b5a7e122dc9f4/sq/proteinpulver-whey-isolate-schoko-900-g.jpg?format=auto&f=969x969",
        "countInStock": 18,
        "colors": [
            "Black",
            "White",
            "Blue",
            "Red"
        ],
        "sizes": [
            "XL"
        ],
        "description": "couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is",
        "numReviews": 7,
        "reviews": [
            {
                "author": "Victor",
                "text": "bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll",
                "date": "2022-02-17",
                "rating": 3
            },
            {
                "author": "Kim",
                "text": "bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll",
                "date": "2022-11-26",
                "rating": 3
            },
            {
                "author": "Wendy",
                "text": "Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar",
                "date": "2022-04-27",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake",
                "date": "2020-02-13",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake",
                "date": "2024-02-06",
                "rating": 4
            },
            {
                "author": "Judy",
                "text": "apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie",
                "date": "2022-10-03",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice",
                "date": "2021-10-17",
                "rating": 5
            }
        ],
        "averageRating": 3.9
    },
    {
        "name": "OPTIMUM NUTRITION",
        "category": "Protein Extreme Milk Chocolate",
        "price": 45.99,
        "image": "https://contents.mediadecathlon.com/m14581009/k$e99ba0248f5c6aad6d19c1937a6ade93/sq/gold-standard-100-whey-protein-extreme-milk-chocolate-71-portionen-2270-gramm.jpg?format=auto&f=969x969",
        "countInStock": 44,
        "colors": [
            "Green"
        ],
        "sizes": [
            "S",
            "L",
            "M",
            "XL"
        ],
        "description": "until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your",
        "numReviews": 7,
        "reviews": [
            {
                "author": "Oscar",
                "text": "cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut",
                "date": "2023-02-09",
                "rating": 3
            },
            {
                "author": "Nia",
                "text": "halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love",
                "date": "2020-10-06",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I",
                "date": "2022-06-25",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2020-01-16",
                "rating": 3
            },
            {
                "author": "Dave",
                "text": "Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I",
                "date": "2020-04-18",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly",
                "date": "2022-05-29",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels",
                "date": "2021-02-26",
                "rating": 5
            }
        ],
        "averageRating": 3.9
    },
    {
        "name": "FSA NUTRITION",
        "category": "Protein Shaker 800ml",
        "price": 15.99,
        "image": "https://contents.mediadecathlon.com/m11612817/k$274af6328412af270b006f945df1e836/sq/protein-shaker-800ml-auslaufsichere-trinkflasche-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 49,
        "colors": [
            "Black",
            "Blue",
            "Green"
        ],
        "sizes": [
            "S",
            "L",
            "M"
        ],
        "description": "pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at",
        "numReviews": 18,
        "reviews": [
            {
                "author": "Mallory",
                "text": "carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut",
                "date": "2023-01-22",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut",
                "date": "2020-02-13",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love",
                "date": "2021-04-17",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread",
                "date": "2021-12-31",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I",
                "date": "2021-06-27",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I",
                "date": "2020-11-05",
                "rating": 5
            },
            {
                "author": "Quincy",
                "text": "cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake",
                "date": "2022-11-15",
                "rating": 5
            },
            {
                "author": "Kim",
                "text": "gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut",
                "date": "2022-09-23",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice",
                "date": "2021-09-16",
                "rating": 5
            },
            {
                "author": "Dave",
                "text": "I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love",
                "date": "2022-11-02",
                "rating": 4
            },
            {
                "author": "Grace",
                "text": "dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate",
                "date": "2020-04-23",
                "rating": 3
            },
            {
                "author": "Wendy",
                "text": "sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit",
                "date": "2021-07-22",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton",
                "date": "2022-03-27",
                "rating": 5
            },
            {
                "author": "Victor",
                "text": "cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate",
                "date": "2023-10-18",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll",
                "date": "2022-09-05",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread",
                "date": "2022-05-18",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake",
                "date": "2023-08-31",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy",
                "date": "2021-01-16",
                "rating": 5
            }
        ],
        "averageRating": 4.2
    },
    {
        "name": "OPTIMUM NUTRITION",
        "category": "Gainer Serious Mass",
        "price": 45.99,
        "image": "https://contents.mediadecathlon.com/m10817520/k$198a1846c73b2651f7de968c88d6af12/sq/gainer-serious-mass-273kg-optimum-nutrition.jpg?format=auto&f=969x969",
        "countInStock": 89,
        "colors": [
            "Red",
            "Black",
            "White"
        ],
        "sizes": [
            "L",
            "XL"
        ],
        "description": "face destroy the blinds. Jump around on couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed",
        "numReviews": 8,
        "reviews": [
            {
                "author": "Trudy",
                "text": "Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit",
                "date": "2020-02-08",
                "rating": 4
            },
            {
                "author": "Barış",
                "text": "tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut",
                "date": "2020-05-18",
                "rating": 5
            },
            {
                "author": "Pat",
                "text": "apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton",
                "date": "2020-01-12",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu",
                "date": "2023-07-30",
                "rating": 5
            },
            {
                "author": "Nia",
                "text": "cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate",
                "date": "2020-09-23",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar",
                "date": "2021-04-04",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop",
                "date": "2023-07-17",
                "rating": 3
            },
            {
                "author": "Pat",
                "text": "Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy",
                "date": "2021-02-16",
                "rating": 4
            }
        ],
        "averageRating": 4.1
    },
    {
        "name": "WEIDER",
        "category": "Proteinpulver Vegan",
        "price": 28.99,
        "image": "https://contents.mediadecathlon.com/p2483448/k$ad8075ed76501e6440b95515aea41ace/sq/proteinpulver-vegan-750-g-schokolade.jpg?format=auto&f=969x969",
        "countInStock": 39,
        "colors": [
            "White",
            "Blue",
            "Red",
            "Black",
            "Green"
        ],
        "sizes": [
            "M",
            "L"
        ],
        "description": "dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going",
        "numReviews": 11,
        "reviews": [
            {
                "author": "Alice",
                "text": "jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I",
                "date": "2022-11-14",
                "rating": 4
            },
            {
                "author": "Nia",
                "text": "cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake",
                "date": "2023-12-08",
                "rating": 4
            },
            {
                "author": "Pat",
                "text": "tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow",
                "date": "2022-11-13",
                "rating": 5
            },
            {
                "author": "Judy",
                "text": "I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes",
                "date": "2022-05-11",
                "rating": 3
            },
            {
                "author": "Trudy",
                "text": "chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop.",
                "date": "2021-01-15",
                "rating": 4
            },
            {
                "author": "Pat",
                "text": "marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2021-12-06",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I",
                "date": "2020-08-12",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping.",
                "date": "2023-06-22",
                "rating": 3
            },
            {
                "author": "Oscar",
                "text": "amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I",
                "date": "2022-03-10",
                "rating": 4
            },
            {
                "author": "Pat",
                "text": "cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop",
                "date": "2023-04-06",
                "rating": 5
            },
            {
                "author": "Alice",
                "text": "danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love",
                "date": "2021-06-18",
                "rating": 5
            }
        ],
        "averageRating": 4.1
    }
]