[
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 75.99,
        "image": "https://contents.mediadecathlon.com/p2579115/k$a4e5545d7b3c735722072c33202b5eb5/sq/winterschuhe-herren-warm-wasserdicht-winterwandern-sh100-blau.jpg?format=auto&f=969x969",
        "countInStock": 0,
        "colors": [
            "Black",
            "Green",
            "Blue",
            "Red",
            "White"
        ],
        "sizes": [
            "M"
        ],
        "description": "video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun",
        "numReviews": 15,
        "reviews": [
            {
                "author": "Andreea",
                "text": "candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2023-01-27",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum",
                "date": "2020-03-20",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish.",
                "date": "2021-02-10",
                "rating": 5
            },
            {
                "author": "Mallory",
                "text": "I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie",
                "date": "2023-05-07",
                "rating": 5
            },
            {
                "author": "Nia",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake",
                "date": "2022-07-22",
                "rating": 5
            },
            {
                "author": "Nia",
                "text": "cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut",
                "date": "2022-03-13",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I",
                "date": "2023-08-22",
                "rating": 3
            },
            {
                "author": "Pat",
                "text": "Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer",
                "date": "2022-09-20",
                "rating": 4
            },
            {
                "author": "Charlie",
                "text": "donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding",
                "date": "2022-07-16",
                "rating": 3
            },
            {
                "author": "Eve",
                "text": "jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o",
                "date": "2023-09-10",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu",
                "date": "2023-08-09",
                "rating": 4
            },
            {
                "author": "Dave",
                "text": "roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2022-11-28",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding sweet muffin.",
                "date": "2024-01-06",
                "rating": 3
            },
            {
                "author": "Sybil",
                "text": "Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream.",
                "date": "2024-02-17",
                "rating": 4
            },
            {
                "author": "Charlie",
                "text": "tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream",
                "date": "2020-07-03",
                "rating": 4
            }
        ],
        "averageRating": 4.0,
        "discount": 59
    },
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 30.99,
        "image": "https://contents.mediadecathlon.com/p2579568/k$376c6239f4c6a4d0a5e76307b4397545/sq/wanderschuhe-mh120-halbhoch-wasserdicht-kinder-gr-3538-turkis.jpg?format=auto&f=969x969",
        "countInStock": 75,
        "colors": [
            "Green",
            "Red"
        ],
        "sizes": [
            "XL"
        ],
        "description": "catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun",
        "numReviews": 7,
        "reviews": [
            {
                "author": "Charlie",
                "text": "cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie",
                "date": "2022-02-28",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll",
                "date": "2021-10-04",
                "rating": 4
            },
            {
                "author": "Nia",
                "text": "roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread",
                "date": "2023-11-13",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2020-04-19",
                "rating": 4
            },
            {
                "author": "Victor",
                "text": "gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate",
                "date": "2023-02-12",
                "rating": 3
            },
            {
                "author": "Judy",
                "text": "tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread",
                "date": "2022-01-08",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love",
                "date": "2021-12-14",
                "rating": 3
            }
        ],
        "averageRating": 3.7,
        "discount": 54
    },
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 80.99,
        "image": "https://contents.mediadecathlon.com/p2164495/k$6df40368e2b7ac6d887b55812f132d71/sq/wanderschuhe-herren-atmungsaktiv-escape-500-fresh.jpg?format=auto&f=969x969",
        "countInStock": 84,
        "colors": [
            "Black",
            "Red",
            "White"
        ],
        "sizes": [
            "M"
        ],
        "description": "blinds. Jump around on couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time",
        "numReviews": 8,
        "reviews": [
            {
                "author": "Victor",
                "text": "biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry",
                "date": "2023-12-09",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love",
                "date": "2020-09-12",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar",
                "date": "2022-10-06",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu",
                "date": "2024-01-25",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll",
                "date": "2022-11-22",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o",
                "date": "2023-03-10",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar",
                "date": "2021-01-25",
                "rating": 3
            },
            {
                "author": "Victor",
                "text": "shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I",
                "date": "2021-11-10",
                "rating": 4
            }
        ],
        "averageRating": 3.9
    },
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 60.99,
        "image": "https://contents.mediadecathlon.com/p2579497/k$11bdadeb50c9743829241be7aa67d124/sq/winterschuhe-damen-halbhoch-warm-wasserdicht-winterwandern-sh500.jpg?format=auto&f=969x969",
        "countInStock": 34,
        "colors": [
            "Black",
            "White",
            "Red"
        ],
        "sizes": [
            "S",
            "L"
        ],
        "description": "and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video",
        "numReviews": 5,
        "reviews": [
            {
                "author": "Nia",
                "text": "candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice",
                "date": "2023-07-07",
                "rating": 3
            },
            {
                "author": "Andreea",
                "text": "bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I",
                "date": "2021-08-18",
                "rating": 3
            },
            {
                "author": "Randy",
                "text": "I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie",
                "date": "2023-05-04",
                "rating": 3
            },
            {
                "author": "Eve",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread",
                "date": "2023-05-28",
                "rating": 4
            },
            {
                "author": "Pat",
                "text": "jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear",
                "date": "2020-03-11",
                "rating": 3
            }
        ],
        "averageRating": 3.2
    },
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 70.99,
        "image": "https://contents.mediadecathlon.com/p2579290/k$8468656899ba30e314aff19f13e104bf/sq/winterschuhe-damen-halbhoch-leder-warm-wasserdicht-winterwandern-sh900-braun.jpg?format=auto&f=969x969",
        "countInStock": 38,
        "colors": [
            "Green",
            "Blue",
            "White",
            "Red",
            "Black"
        ],
        "sizes": [
            "L",
            "XL",
            "M",
            "S"
        ],
        "description": "now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power",
        "numReviews": 1,
        "reviews": [
            {
                "author": "Trudy",
                "text": "love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2023-08-08",
                "rating": 5
            }
        ],
        "averageRating": 5.0
    },
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 90.99,
        "image": "https://contents.mediadecathlon.com/p2579242/k$626aeecd798bc629b208147cd263b0e3/sq/winterschuhe-herren-leder-hoch-warm-wasserdicht-winterwandern-sh900-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 47,
        "colors": [
            "Red"
        ],
        "sizes": [
            "XL",
            "S"
        ],
        "description": "chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today.",
        "numReviews": 8,
        "reviews": [
            {
                "author": "Kim",
                "text": "chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream.",
                "date": "2021-01-12",
                "rating": 5
            },
            {
                "author": "Wendy",
                "text": "jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy",
                "date": "2023-04-21",
                "rating": 4
            },
            {
                "author": "Pat",
                "text": "Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee",
                "date": "2021-11-27",
                "rating": 3
            },
            {
                "author": "Ömer",
                "text": "I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread",
                "date": "2021-07-11",
                "rating": 3
            },
            {
                "author": "Eve",
                "text": "ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels",
                "date": "2022-08-16",
                "rating": 3
            },
            {
                "author": "Randy",
                "text": "jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love",
                "date": "2023-12-07",
                "rating": 3
            },
            {
                "author": "Randy",
                "text": "marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I",
                "date": "2021-07-18",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice",
                "date": "2020-05-15",
                "rating": 4
            }
        ],
        "averageRating": 3.6
    },
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 70.99,
        "image": "https://contents.mediadecathlon.com/p2579406/k$dd7323636ecc4c363aeb30ea78693e97/sq/wanderschuhe-crossrock-halbh-wasserdicht-schnellschnurung-kinder-gr-2834-grau.jpg?format=auto&f=969x969",
        "countInStock": 49,
        "colors": [
            "Green"
        ],
        "sizes": [
            "L",
            "XL",
            "M",
            "S"
        ],
        "description": "chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going",
        "numReviews": 20,
        "reviews": [
            {
                "author": "Kim",
                "text": "jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice",
                "date": "2023-10-31",
                "rating": 4
            },
            {
                "author": "Judy",
                "text": "jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie",
                "date": "2022-09-18",
                "rating": 4
            },
            {
                "author": "Oscar",
                "text": "cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream.",
                "date": "2022-07-26",
                "rating": 4
            },
            {
                "author": "Dave",
                "text": "dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream",
                "date": "2021-01-22",
                "rating": 5
            },
            {
                "author": "Pat",
                "text": "lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie",
                "date": "2020-02-29",
                "rating": 4
            },
            {
                "author": "Bob",
                "text": "roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate",
                "date": "2023-06-26",
                "rating": 4
            },
            {
                "author": "Pat",
                "text": "tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu",
                "date": "2023-06-24",
                "rating": 3
            },
            {
                "author": "Randy",
                "text": "chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread",
                "date": "2021-11-09",
                "rating": 5
            },
            {
                "author": "Nia",
                "text": "marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate",
                "date": "2021-01-06",
                "rating": 3
            },
            {
                "author": "Judy",
                "text": "liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly",
                "date": "2021-07-25",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie",
                "date": "2023-07-02",
                "rating": 5
            },
            {
                "author": "Mallory",
                "text": "candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2022-04-24",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly",
                "date": "2021-11-16",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love",
                "date": "2022-12-07",
                "rating": 5
            },
            {
                "author": "Barış",
                "text": "lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps",
                "date": "2022-12-21",
                "rating": 3
            },
            {
                "author": "Victor",
                "text": "sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate",
                "date": "2023-11-14",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o",
                "date": "2024-02-09",
                "rating": 5
            },
            {
                "author": "Oscar",
                "text": "soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake",
                "date": "2022-04-16",
                "rating": 5
            },
            {
                "author": "Randy",
                "text": "Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice",
                "date": "2022-12-08",
                "rating": 5
            },
            {
                "author": "Quincy",
                "text": "bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly",
                "date": "2020-01-15",
                "rating": 4
            }
        ],
        "averageRating": 4.2
    },
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 65.99,
        "image": "https://contents.mediadecathlon.com/p2579512/k$b560a0b2371ca770ca6b63a5b09cc3fe/sq/wanderschuhe-crossrock-halbh-wasserdicht-schnellschnurung-kinder-gr-3538-grau.jpg?format=auto&f=969x969",
        "countInStock": 45,
        "colors": [
            "Black",
            "Blue",
            "Red",
            "White",
            "Green"
        ],
        "sizes": [
            "XL"
        ],
        "description": "to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase",
        "numReviews": 17,
        "reviews": [
            {
                "author": "Andreea",
                "text": "ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish.",
                "date": "2023-11-24",
                "rating": 3
            },
            {
                "author": "Trudy",
                "text": "jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee",
                "date": "2020-11-19",
                "rating": 3
            },
            {
                "author": "Nia",
                "text": "Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut",
                "date": "2021-07-03",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly",
                "date": "2023-11-12",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake",
                "date": "2022-12-16",
                "rating": 5
            },
            {
                "author": "Alice",
                "text": "gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love",
                "date": "2021-10-11",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "Cupcake ipsum dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o",
                "date": "2023-04-02",
                "rating": 3
            },
            {
                "author": "Barış",
                "text": "dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon",
                "date": "2022-12-07",
                "rating": 3
            },
            {
                "author": "Kim",
                "text": "sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps",
                "date": "2024-01-17",
                "rating": 4
            },
            {
                "author": "Dave",
                "text": "cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie",
                "date": "2022-07-09",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie",
                "date": "2022-04-29",
                "rating": 4
            },
            {
                "author": "Dave",
                "text": "pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut",
                "date": "2022-07-01",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake",
                "date": "2021-02-19",
                "rating": 5
            },
            {
                "author": "Charlie",
                "text": "candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie",
                "date": "2022-10-28",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple",
                "date": "2022-06-11",
                "rating": 5
            },
            {
                "author": "Wendy",
                "text": "cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut",
                "date": "2022-08-16",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet.",
                "date": "2022-02-11",
                "rating": 4
            }
        ],
        "averageRating": 3.9,
        "discount": 51
    },
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 99.99,
        "image": "https://contents.mediadecathlon.com/p2578997/k$0ee93cfa5084bc45b18fc1aaf019d15f/sq/winterschuhe-kinder-gr-2434-leder-klett-warm-wasserdicht-sh500-braun.jpg?format=auto&f=969x969",
        "countInStock": 87,
        "colors": [
            "Green",
            "Black",
            "Red",
            "Blue"
        ],
        "sizes": [
            "L",
            "S",
            "M"
        ],
        "description": "blinds. Jump around on couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going",
        "numReviews": 1,
        "reviews": [
            {
                "author": "Quincy",
                "text": "dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar",
                "date": "2022-09-27",
                "rating": 4
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "EVADICT",
        "category": "shoes",
        "price": 120.99,
        "image": "https://contents.mediadecathlon.com/p2317397/k$fb9833d2b796c77819288d11d770da5f/sq/laufschuhe-trail-mt2-herren-blaugrun.jpg?format=auto&f=969x969",
        "countInStock": 86,
        "colors": [
            "Green",
            "White"
        ],
        "sizes": [
            "L"
        ],
        "description": "pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run",
        "numReviews": 16,
        "reviews": [
            {
                "author": "Alice",
                "text": "Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu",
                "date": "2023-07-05",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2022-08-10",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie",
                "date": "2023-04-13",
                "rating": 5
            },
            {
                "author": "Kim",
                "text": "snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit",
                "date": "2022-08-10",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake",
                "date": "2021-10-24",
                "rating": 3
            },
            {
                "author": "Alice",
                "text": "lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy",
                "date": "2021-01-24",
                "rating": 5
            },
            {
                "author": "Eve",
                "text": "cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie",
                "date": "2020-12-03",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps",
                "date": "2022-07-12",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly",
                "date": "2020-08-06",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate",
                "date": "2020-02-06",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice",
                "date": "2022-02-05",
                "rating": 3
            },
            {
                "author": "Alice",
                "text": "love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry",
                "date": "2022-10-29",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée",
                "date": "2021-11-05",
                "rating": 5
            },
            {
                "author": "Oscar",
                "text": "caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2023-07-15",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I",
                "date": "2021-04-06",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy",
                "date": "2020-03-23",
                "rating": 5
            }
        ],
        "averageRating": 4.1
    },
    {
        "name": "QUECHUA",
        "category": "shoes",
        "price": 85.99,
        "image": "https://contents.mediadecathlon.com/p2583208/k$98aafedc771378d6f8762fdd7082ec27/sq/wanderschuhe-herren-nh100-halbhoch-grau.jpg?format=auto&f=969x969",
        "countInStock": 70,
        "colors": [
            "Black",
            "Green"
        ],
        "sizes": [
            "XL",
            "L"
        ],
        "description": "love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch. Chew iPad power cord soft kitty warm kitty little ball of",
        "numReviews": 15,
        "reviews": [
            {
                "author": "Randy",
                "text": "cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet",
                "date": "2023-09-25",
                "rating": 5
            },
            {
                "author": "Grace",
                "text": "roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate",
                "date": "2020-07-29",
                "rating": 3
            },
            {
                "author": "Trudy",
                "text": "dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar",
                "date": "2023-04-05",
                "rating": 3
            },
            {
                "author": "Oscar",
                "text": "cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon",
                "date": "2023-02-24",
                "rating": 3
            },
            {
                "author": "Ivan",
                "text": "liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake",
                "date": "2021-04-14",
                "rating": 5
            },
            {
                "author": "Sybil",
                "text": "candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I",
                "date": "2020-03-15",
                "rating": 3
            },
            {
                "author": "Trudy",
                "text": "dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum",
                "date": "2021-04-05",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I",
                "date": "2022-10-04",
                "rating": 4
            },
            {
                "author": "Victor",
                "text": "dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake",
                "date": "2023-10-27",
                "rating": 5
            },
            {
                "author": "Alice",
                "text": "Cupcake ipsum dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake",
                "date": "2023-01-12",
                "rating": 3
            },
            {
                "author": "Pat",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow",
                "date": "2023-12-24",
                "rating": 3
            },
            {
                "author": "Charlie",
                "text": "chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet",
                "date": "2020-07-31",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake",
                "date": "2021-02-01",
                "rating": 3
            },
            {
                "author": "Randy",
                "text": "dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee",
                "date": "2021-12-09",
                "rating": 5
            },
            {
                "author": "Ivan",
                "text": "sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice",
                "date": "2023-07-13",
                "rating": 4
            }
        ],
        "averageRating": 3.8
    },
    {
        "name": "FORCLAZ",
        "category": "shoes",
        "price": 115.99,
        "image": "https://contents.mediadecathlon.com/p2573016/k$2534236b7289f69b09ddc7087894f903/sq/trekkingschuhe-herren-leder-hoch-breit-wasserdicht-bergwandern-mt100.jpg?format=auto&f=969x969",
        "countInStock": 19,
        "colors": [
            "Green",
            "Red"
        ],
        "sizes": [
            "M",
            "S",
            "L"
        ],
        "description": "moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today.",
        "numReviews": 9,
        "reviews": [
            {
                "author": "Andreea",
                "text": "pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee",
                "date": "2023-02-17",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love",
                "date": "2020-11-13",
                "rating": 4
            },
            {
                "author": "Grace",
                "text": "donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake",
                "date": "2024-02-09",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee",
                "date": "2023-08-24",
                "rating": 5
            },
            {
                "author": "Frank",
                "text": "bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love",
                "date": "2022-08-05",
                "rating": 3
            },
            {
                "author": "Pat",
                "text": "cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping.",
                "date": "2023-02-18",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans",
                "date": "2023-10-02",
                "rating": 3
            },
            {
                "author": "Sybil",
                "text": "amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream",
                "date": "2023-10-15",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon",
                "date": "2023-12-03",
                "rating": 4
            }
        ],
        "averageRating": 3.9
    },
    {
        "name": "DOMYOS",
        "category": "T-shirt",
        "price": 0.99,
        "image": "https://contents.mediadecathlon.com/p2415460/k$0deb88a531ff2a015e7b87f3cdccd161/sq/t-shirt-herren-rundhalsausschnitt-regular-500-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 42,
        "colors": [
            "Red",
            "White",
            "Black",
            "Blue",
            "Green"
        ],
        "sizes": [
            "L"
        ],
        "description": "meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to",
        "numReviews": 16,
        "reviews": [
            {
                "author": "Charlie",
                "text": "topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I",
                "date": "2022-05-18",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop.",
                "date": "2022-02-03",
                "rating": 5
            },
            {
                "author": "Trudy",
                "text": "Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll",
                "date": "2020-02-01",
                "rating": 4
            },
            {
                "author": "Nia",
                "text": "candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop",
                "date": "2023-03-09",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie",
                "date": "2022-04-15",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels",
                "date": "2023-04-18",
                "rating": 5
            },
            {
                "author": "Pat",
                "text": "tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2022-04-26",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake",
                "date": "2022-02-06",
                "rating": 3
            },
            {
                "author": "Mallory",
                "text": "Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry",
                "date": "2022-04-29",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding",
                "date": "2022-01-09",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake",
                "date": "2021-01-30",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly",
                "date": "2020-11-15",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly",
                "date": "2021-02-01",
                "rating": 3
            },
            {
                "author": "Randy",
                "text": "jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake",
                "date": "2020-03-19",
                "rating": 4
            },
            {
                "author": "Bob",
                "text": "love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu",
                "date": "2024-01-09",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame",
                "date": "2020-01-13",
                "rating": 5
            }
        ],
        "averageRating": 4.1
    },
    {
        "name": "SIMOND",
        "category": "T-shirt",
        "price": 20.99,
        "image": "https://contents.mediadecathlon.com/p2037327/k$43449ce0aa79a0931e79182d77808cdd/sq/t-shirt-langarm-seamless-wolle-bergsteigen-damen.jpg?format=auto&f=969x969",
        "countInStock": 93,
        "colors": [
            "Black",
            "White",
            "Green",
            "Red"
        ],
        "sizes": [
            "S",
            "XL"
        ],
        "description": "dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red",
        "numReviews": 4,
        "reviews": [
            {
                "author": "Judy",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton",
                "date": "2023-09-21",
                "rating": 3
            },
            {
                "author": "Andreea",
                "text": "tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow",
                "date": "2020-08-14",
                "rating": 4
            },
            {
                "author": "Oscar",
                "text": "donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding",
                "date": "2022-07-13",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels",
                "date": "2020-08-10",
                "rating": 4
            }
        ],
        "averageRating": 3.8
    },
    {
        "name": "ADIDAS",
        "category": "T-shirt",
        "price": 25.99,
        "image": "https://contents.mediadecathlon.com/p2518269/k$ff9fdba7aa03ac53f2571a812fbfa360/sq/adidas-t-shirt-damen-vibaop-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 61,
        "colors": [
            "Red",
            "White",
            "Black",
            "Green",
            "Blue"
        ],
        "sizes": [
            "M",
            "S",
            "L",
            "XL"
        ],
        "description": "going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch. Chew iPad power cord soft kitty warm kitty",
        "numReviews": 7,
        "reviews": [
            {
                "author": "Kim",
                "text": "chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll",
                "date": "2022-03-26",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "ipsum dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2022-05-26",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy",
                "date": "2022-09-26",
                "rating": 5
            },
            {
                "author": "Ivan",
                "text": "I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie",
                "date": "2021-02-16",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake",
                "date": "2021-10-26",
                "rating": 4
            },
            {
                "author": "Pat",
                "text": "cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I",
                "date": "2022-02-14",
                "rating": 3
            },
            {
                "author": "Eve",
                "text": "cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut",
                "date": "2021-05-13",
                "rating": 3
            }
        ],
        "averageRating": 3.9
    },
    {
        "name": "PUMA",
        "category": "T-shirt",
        "price": 40.99,
        "image": "https://contents.mediadecathlon.com/p2473079/k$18c17edb0d0fcf9503a395a657dbb64a/sq/puma-t-shirt-herren-baumwolle-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 45,
        "colors": [
            "Blue",
            "Green",
            "White",
            "Red",
            "Black"
        ],
        "sizes": [
            "S",
            "XL",
            "L",
            "M"
        ],
        "description": "destroy the blinds. Jump around on couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing",
        "numReviews": 8,
        "reviews": [
            {
                "author": "Oscar",
                "text": "pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow",
                "date": "2020-06-14",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee",
                "date": "2023-05-18",
                "rating": 5
            },
            {
                "author": "Grace",
                "text": "tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie",
                "date": "2021-05-12",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice",
                "date": "2021-08-19",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2022-02-03",
                "rating": 5
            },
            {
                "author": "Ömer",
                "text": "shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum",
                "date": "2020-03-09",
                "rating": 4
            },
            {
                "author": "Victor",
                "text": "plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice",
                "date": "2020-09-09",
                "rating": 3
            },
            {
                "author": "Sybil",
                "text": "jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread",
                "date": "2021-03-30",
                "rating": 3
            }
        ],
        "averageRating": 4.0,
        "discount": 69
    },
    {
        "name": "NEWLINE",
        "category": "T-shirt",
        "price": 35.99,
        "image": "https://contents.mediadecathlon.com/m14411222/k$c2094cc84f160b0e668a9612e1b2cb88/sq/core-functional-t-shirt-herren-laufen-mit-recyceltes-polyester.jpg?format=auto&f=969x969",
        "countInStock": 35,
        "colors": [
            "Green",
            "Red"
        ],
        "sizes": [
            "L"
        ],
        "description": "going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch.",
        "numReviews": 9,
        "reviews": [
            {
                "author": "Judy",
                "text": "biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding sweet muffin.",
                "date": "2021-07-05",
                "rating": 4
            },
            {
                "author": "Barış",
                "text": "Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread.",
                "date": "2022-10-02",
                "rating": 5
            },
            {
                "author": "Dave",
                "text": "gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar",
                "date": "2021-03-05",
                "rating": 5
            },
            {
                "author": "Nia",
                "text": "tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o",
                "date": "2023-03-27",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow",
                "date": "2022-11-01",
                "rating": 5
            },
            {
                "author": "Barış",
                "text": "jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love",
                "date": "2021-04-01",
                "rating": 4
            },
            {
                "author": "Charlie",
                "text": "danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love",
                "date": "2020-07-21",
                "rating": 3
            },
            {
                "author": "Frank",
                "text": "chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping.",
                "date": "2022-07-30",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love",
                "date": "2021-08-09",
                "rating": 3
            }
        ],
        "averageRating": 4.1,
        "discount": 40
    },
    {
        "name": "ADIDAS",
        "category": "T-shirt",
        "price": 45.99,
        "image": "https://contents.mediadecathlon.com/p1949471/k$364209fd43ff54e7f180ac1e28919407/sq/adidas-t-shirt-damen-weiss.jpg?format=auto&f=969x969",
        "countInStock": 40,
        "colors": [
            "White",
            "Red",
            "Blue"
        ],
        "sizes": [
            "XL",
            "L",
            "S"
        ],
        "description": "moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love",
        "numReviews": 18,
        "reviews": [
            {
                "author": "Trudy",
                "text": "candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate",
                "date": "2020-02-02",
                "rating": 5
            },
            {
                "author": "Bob",
                "text": "gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu",
                "date": "2021-03-28",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll",
                "date": "2022-05-04",
                "rating": 3
            },
            {
                "author": "Charlie",
                "text": "tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry",
                "date": "2022-10-18",
                "rating": 5
            },
            {
                "author": "Wendy",
                "text": "cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll",
                "date": "2021-11-01",
                "rating": 3
            },
            {
                "author": "Oscar",
                "text": "candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum",
                "date": "2020-09-06",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love",
                "date": "2020-05-27",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly",
                "date": "2020-08-24",
                "rating": 3
            },
            {
                "author": "Bob",
                "text": "bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy",
                "date": "2021-03-23",
                "rating": 5
            },
            {
                "author": "Grace",
                "text": "chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly",
                "date": "2020-03-30",
                "rating": 4
            },
            {
                "author": "Nia",
                "text": "cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly",
                "date": "2021-04-30",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah",
                "date": "2021-05-19",
                "rating": 4
            },
            {
                "author": "Nia",
                "text": "bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream",
                "date": "2022-05-30",
                "rating": 3
            },
            {
                "author": "Sybil",
                "text": "pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels",
                "date": "2021-04-30",
                "rating": 4
            },
            {
                "author": "Charlie",
                "text": "cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish",
                "date": "2022-06-26",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot",
                "date": "2020-01-29",
                "rating": 4
            },
            {
                "author": "Victor",
                "text": "tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2023-08-13",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love",
                "date": "2021-09-18",
                "rating": 4
            }
        ],
        "averageRating": 3.9
    },
    {
        "name": "ADIDAS",
        "category": "Shorts",
        "price": 50.99,
        "image": "https://contents.mediadecathlon.com/p2232681/k$44e5b05a708151d5781a6c35f24a2803/sq/fussballhose-kurz-entrada-22-damenherren-schwarz-adidas.jpg?format=auto&f=969x969",
        "countInStock": 11,
        "colors": [
            "Blue",
            "Black",
            "Red",
            "White",
            "Green"
        ],
        "sizes": [
            "M",
            "XL"
        ],
        "description": "Jump around on couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going",
        "numReviews": 15,
        "reviews": [
            {
                "author": "Grace",
                "text": "cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit",
                "date": "2023-05-22",
                "rating": 5
            },
            {
                "author": "Eve",
                "text": "Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake.",
                "date": "2020-08-23",
                "rating": 3
            },
            {
                "author": "Grace",
                "text": "jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love",
                "date": "2021-05-08",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie",
                "date": "2023-07-17",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie",
                "date": "2022-11-26",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding",
                "date": "2020-01-21",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate",
                "date": "2023-09-17",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love",
                "date": "2023-06-03",
                "rating": 4
            },
            {
                "author": "Victor",
                "text": "cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2023-10-10",
                "rating": 5
            },
            {
                "author": "Mallory",
                "text": "tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love",
                "date": "2021-05-23",
                "rating": 3
            },
            {
                "author": "Judy",
                "text": "I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie",
                "date": "2022-05-24",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah",
                "date": "2023-04-03",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit",
                "date": "2021-06-08",
                "rating": 3
            },
            {
                "author": "Barış",
                "text": "gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o",
                "date": "2022-09-15",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate",
                "date": "2020-01-23",
                "rating": 4
            }
        ],
        "averageRating": 3.9
    },
    {
        "name": "VAN RYSEL",
        "category": "Shorts",
        "price": 25.99,
        "image": "https://contents.mediadecathlon.com/p2464640/k$2128155f26c4de31847d8b9794c801c4/sq/radhose-kurz-ohne-trager-rc-100-herren-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 17,
        "colors": [
            "Red",
            "White",
            "Black"
        ],
        "sizes": [
            "M"
        ],
        "description": "that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to",
        "numReviews": 1,
        "reviews": [
            {
                "author": "Heidi",
                "text": "cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake",
                "date": "2022-08-05",
                "rating": 4
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "KIPSTA",
        "category": "Shorts",
        "price": 54.99,
        "image": "https://contents.mediadecathlon.com/p1988733/k$88cab28e99bcd0d1dcc9d0176a67e2a2/sq/kinder-torwarthose-kurz-f100-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 57,
        "colors": [
            "White",
            "Red"
        ],
        "sizes": [
            "S",
            "M"
        ],
        "description": "given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your",
        "numReviews": 8,
        "reviews": [
            {
                "author": "Frank",
                "text": "pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love",
                "date": "2020-01-29",
                "rating": 5
            },
            {
                "author": "Judy",
                "text": "cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding sweet muffin.",
                "date": "2020-08-03",
                "rating": 3
            },
            {
                "author": "Quincy",
                "text": "I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice",
                "date": "2021-01-31",
                "rating": 3
            },
            {
                "author": "Kim",
                "text": "I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate",
                "date": "2020-07-18",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry",
                "date": "2021-10-17",
                "rating": 3
            },
            {
                "author": "Ivan",
                "text": "snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love",
                "date": "2023-10-21",
                "rating": 5
            },
            {
                "author": "Barış",
                "text": "candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet.",
                "date": "2022-08-29",
                "rating": 4
            },
            {
                "author": "Charlie",
                "text": "roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread",
                "date": "2021-05-11",
                "rating": 4
            }
        ],
        "averageRating": 3.9
    },
    {
        "name": "ROCKRIDER",
        "category": "Shorts",
        "price": 30.99,
        "image": "https://contents.mediadecathlon.com/p2490944/k$95409e4d56d1ece7b3e2cece768c5bbc/sq/herren-mtb-short-kurze-radhose-expl-100-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 22,
        "colors": [
            "White"
        ],
        "sizes": [
            "M",
            "XL",
            "L",
            "S"
        ],
        "description": "Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run",
        "numReviews": 16,
        "reviews": [
            {
                "author": "Wendy",
                "text": "Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream.",
                "date": "2023-06-21",
                "rating": 4
            },
            {
                "author": "Judy",
                "text": "lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread",
                "date": "2021-04-02",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love",
                "date": "2020-01-29",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton",
                "date": "2022-09-08",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread",
                "date": "2020-07-20",
                "rating": 4
            },
            {
                "author": "Pat",
                "text": "candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly",
                "date": "2021-10-05",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton",
                "date": "2021-08-26",
                "rating": 4
            },
            {
                "author": "Pat",
                "text": "cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love",
                "date": "2021-12-23",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate",
                "date": "2020-11-19",
                "rating": 4
            },
            {
                "author": "Grace",
                "text": "bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps",
                "date": "2021-12-29",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton",
                "date": "2022-07-30",
                "rating": 5
            },
            {
                "author": "Wendy",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels",
                "date": "2020-10-26",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream.",
                "date": "2020-06-29",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon",
                "date": "2023-11-10",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie",
                "date": "2022-08-27",
                "rating": 4
            },
            {
                "author": "Barış",
                "text": "tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop",
                "date": "2023-09-03",
                "rating": 3
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "ROCKRIDER",
        "category": "Shorts",
        "price": 20.99,
        "image": "https://contents.mediadecathlon.com/p2490865/k$1f095e36f68618bd08b67503ea684b10/sq/radhose-kurz-mtb-expl-500-herren-2-in-1-radsport-innenhose-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 40,
        "colors": [
            "Red"
        ],
        "sizes": [
            "XL",
            "L"
        ],
        "description": "power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch. Chew iPad power cord soft kitty warm kitty little ball",
        "numReviews": 20,
        "reviews": [
            {
                "author": "Oscar",
                "text": "danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread",
                "date": "2023-07-01",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I",
                "date": "2020-11-05",
                "rating": 4
            },
            {
                "author": "Bob",
                "text": "jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar",
                "date": "2020-03-13",
                "rating": 5
            },
            {
                "author": "Sybil",
                "text": "jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love",
                "date": "2020-11-29",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit",
                "date": "2021-06-27",
                "rating": 5
            },
            {
                "author": "Heidi",
                "text": "topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet.",
                "date": "2020-05-08",
                "rating": 5
            },
            {
                "author": "Victor",
                "text": "sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I",
                "date": "2020-06-26",
                "rating": 4
            },
            {
                "author": "Bob",
                "text": "topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy",
                "date": "2022-01-19",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2020-07-12",
                "rating": 4
            },
            {
                "author": "Grace",
                "text": "I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly",
                "date": "2024-02-12",
                "rating": 3
            },
            {
                "author": "Andreea",
                "text": "chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes",
                "date": "2022-07-23",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow",
                "date": "2020-04-29",
                "rating": 5
            },
            {
                "author": "Oscar",
                "text": "lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop.",
                "date": "2021-03-27",
                "rating": 5
            },
            {
                "author": "Bob",
                "text": "love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream.",
                "date": "2023-01-01",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot",
                "date": "2020-06-15",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot",
                "date": "2020-06-02",
                "rating": 4
            },
            {
                "author": "Bob",
                "text": "roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot",
                "date": "2023-08-27",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut",
                "date": "2023-09-02",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I",
                "date": "2023-06-14",
                "rating": 3
            },
            {
                "author": "Heidi",
                "text": "ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2021-05-16",
                "rating": 4
            }
        ],
        "averageRating": 4.2
    },
    {
        "name": "WEDZE",
        "category": "Schneeanzug",
        "price": 95.99,
        "image": "https://contents.mediadecathlon.com/p2598755/k$473abb24ed74ffb7228c68b6ad320596/sq/schneeanzug-skianzug-kinder-warm-wasserdicht-500-rosablau.jpg?format=auto&f=969x969",
        "countInStock": 4,
        "colors": [
            "White"
        ],
        "sizes": [
            "S"
        ],
        "description": "blinds. Jump around on couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet",
        "numReviews": 17,
        "reviews": [
            {
                "author": "Judy",
                "text": "tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels",
                "date": "2020-04-28",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot",
                "date": "2024-01-08",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream.",
                "date": "2022-04-25",
                "rating": 5
            },
            {
                "author": "Victor",
                "text": "cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2021-11-06",
                "rating": 3
            },
            {
                "author": "Mallory",
                "text": "bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I",
                "date": "2020-10-12",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer",
                "date": "2022-10-05",
                "rating": 5
            },
            {
                "author": "Judy",
                "text": "I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate",
                "date": "2023-12-14",
                "rating": 3
            },
            {
                "author": "Wendy",
                "text": "dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw.",
                "date": "2022-03-29",
                "rating": 4
            },
            {
                "author": "Pat",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy",
                "date": "2021-03-15",
                "rating": 5
            },
            {
                "author": "Dave",
                "text": "candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I",
                "date": "2021-06-02",
                "rating": 3
            },
            {
                "author": "Dave",
                "text": "dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé",
                "date": "2020-12-31",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread",
                "date": "2022-07-21",
                "rating": 4
            },
            {
                "author": "Barış",
                "text": "ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding",
                "date": "2023-03-30",
                "rating": 5
            },
            {
                "author": "Charlie",
                "text": "lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love",
                "date": "2021-09-23",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love",
                "date": "2022-12-14",
                "rating": 3
            },
            {
                "author": "Trudy",
                "text": "Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2021-09-18",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes",
                "date": "2020-05-30",
                "rating": 5
            }
        ],
        "averageRating": 4.1
    },
    {
        "name": "DECATHLON",
        "category": "Sportschuhe",
        "price": 50.99,
        "image": "https://contents.mediadecathlon.com/p1867979/k$76bf92fc67a6e03cbbf5bbaac894c668/sq/sportschuhe-kinder-klettverschluss-wasserdicht-strapazierfahig-resist.jpg?format=auto&f=969x969",
        "countInStock": 16,
        "colors": [
            "White",
            "Green"
        ],
        "sizes": [
            "S",
            "XL",
            "M",
            "L"
        ],
        "description": "face destroy the blinds. Jump around on couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary",
        "numReviews": 17,
        "reviews": [
            {
                "author": "Frank",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o",
                "date": "2020-06-06",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love",
                "date": "2020-11-09",
                "rating": 4
            },
            {
                "author": "Oscar",
                "text": "bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2020-10-17",
                "rating": 5
            },
            {
                "author": "Charlie",
                "text": "dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly",
                "date": "2024-01-07",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice",
                "date": "2022-07-12",
                "rating": 3
            },
            {
                "author": "Ivan",
                "text": "I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2022-02-26",
                "rating": 5
            },
            {
                "author": "Alice",
                "text": "pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut",
                "date": "2020-09-15",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly",
                "date": "2021-11-24",
                "rating": 3
            },
            {
                "author": "Mallory",
                "text": "ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat",
                "date": "2020-06-12",
                "rating": 5
            },
            {
                "author": "Andreea",
                "text": "sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice",
                "date": "2022-07-07",
                "rating": 4
            },
            {
                "author": "Judy",
                "text": "I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love",
                "date": "2023-07-06",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o",
                "date": "2024-02-07",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly",
                "date": "2021-06-27",
                "rating": 4
            },
            {
                "author": "Charlie",
                "text": "roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow",
                "date": "2023-12-24",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly",
                "date": "2022-08-08",
                "rating": 3
            },
            {
                "author": "Nia",
                "text": "jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love",
                "date": "2023-06-26",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding sweet",
                "date": "2020-01-03",
                "rating": 4
            }
        ],
        "averageRating": 4.0,
        "discount": 58
    },
    {
        "name": "WEDZE",
        "category": "Skijacke",
        "price": 50.99,
        "image": "https://contents.mediadecathlon.com/p2583897/k$636f77bebd4c2e831033dc699bcc0067/sq/skijacke-kinder-warm-wasserdicht-550-blau.jpg?format=auto&f=969x969",
        "countInStock": 34,
        "colors": [
            "Black"
        ],
        "sizes": [
            "S"
        ],
        "description": "constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to",
        "numReviews": 9,
        "reviews": [
            {
                "author": "Andreea",
                "text": "plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut",
                "date": "2021-11-24",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée",
                "date": "2023-05-25",
                "rating": 3
            },
            {
                "author": "Alice",
                "text": "cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I",
                "date": "2020-05-12",
                "rating": 5
            },
            {
                "author": "Randy",
                "text": "cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2023-08-23",
                "rating": 3
            },
            {
                "author": "Mallory",
                "text": "Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream.",
                "date": "2021-04-11",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread",
                "date": "2024-01-02",
                "rating": 5
            },
            {
                "author": "Sybil",
                "text": "sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly",
                "date": "2022-10-13",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake",
                "date": "2023-07-31",
                "rating": 5
            },
            {
                "author": "Heidi",
                "text": "bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu",
                "date": "2020-10-30",
                "rating": 3
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "WEDZE",
        "category": "Skihose",
        "price": 20.99,
        "image": "https://contents.mediadecathlon.com/p2579904/k$492ab2201f65a3511de94bd994b87f99/sq/skihose-warm-wasserdicht-100-kinder-neonrosa.jpg?format=auto&f=969x969",
        "countInStock": 60,
        "colors": [
            "Blue",
            "Red"
        ],
        "sizes": [
            "L",
            "XL",
            "M"
        ],
        "description": "time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at",
        "numReviews": 10,
        "reviews": [
            {
                "author": "Quincy",
                "text": "sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot",
                "date": "2023-08-08",
                "rating": 5
            },
            {
                "author": "Barış",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans",
                "date": "2023-08-24",
                "rating": 4
            },
            {
                "author": "Barış",
                "text": "love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie",
                "date": "2022-07-02",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake",
                "date": "2022-12-11",
                "rating": 4
            },
            {
                "author": "Oscar",
                "text": "ipsum dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream",
                "date": "2021-08-16",
                "rating": 5
            },
            {
                "author": "Charlie",
                "text": "Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet.",
                "date": "2023-09-06",
                "rating": 3
            },
            {
                "author": "Charlie",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow",
                "date": "2021-06-28",
                "rating": 3
            },
            {
                "author": "Trudy",
                "text": "beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon",
                "date": "2021-04-01",
                "rating": 3
            },
            {
                "author": "Heidi",
                "text": "plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat",
                "date": "2020-02-25",
                "rating": 5
            },
            {
                "author": "Heidi",
                "text": "jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll",
                "date": "2021-11-07",
                "rating": 3
            }
        ],
        "averageRating": 3.9,
        "discount": 58
    },
    {
        "name": "WEDZE",
        "category": "Skibrille",
        "price": 55.99,
        "image": "https://contents.mediadecathlon.com/p2576945/k$32b2599d5e38124e5ee95d3b819d6681/sq/skibrille-snowboardbrille-erwachsenekinder-allwetter-g-500-i-grau.jpg?format=auto&f=969x969",
        "countInStock": 69,
        "colors": [
            "Black",
            "White",
            "Green",
            "Red",
            "Blue"
        ],
        "sizes": [
            "XL"
        ],
        "description": "imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch",
        "numReviews": 9,
        "reviews": [
            {
                "author": "Bob",
                "text": "lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly",
                "date": "2021-12-03",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly",
                "date": "2023-04-17",
                "rating": 3
            },
            {
                "author": "Charlie",
                "text": "tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2021-12-12",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake",
                "date": "2020-07-10",
                "rating": 3
            },
            {
                "author": "Charlie",
                "text": "pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate",
                "date": "2021-03-16",
                "rating": 4
            },
            {
                "author": "Oscar",
                "text": "roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2020-01-05",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop",
                "date": "2023-01-14",
                "rating": 5
            },
            {
                "author": "Nia",
                "text": "marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate",
                "date": "2020-03-26",
                "rating": 5
            },
            {
                "author": "Frank",
                "text": "Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit",
                "date": "2024-02-04",
                "rating": 3
            }
        ],
        "averageRating": 3.9
    },
    {
        "name": "DREAMSCAPE",
        "category": "Rückenprotektor Ski",
        "price": 65.99,
        "image": "https://contents.mediadecathlon.com/p2598966/k$261e05a2209b76268de8ce15bc58fc5c/sq/ruckenprotektor-ski-snowboard-kinder-dbck-500-orange.jpg?format=auto&f=969x969",
        "countInStock": 63,
        "colors": [
            "Black",
            "White",
            "Blue",
            "Red"
        ],
        "sizes": [
            "XL"
        ],
        "description": "yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love",
        "numReviews": 3,
        "reviews": [
            {
                "author": "Trudy",
                "text": "Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly",
                "date": "2020-06-04",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé",
                "date": "2022-01-15",
                "rating": 5
            },
            {
                "author": "Andreea",
                "text": "tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love",
                "date": "2022-09-26",
                "rating": 3
            }
        ],
        "averageRating": 4.0,
        "discount": 44
    },
    {
        "name": "TUNTURI",
        "category": "Hanteln",
        "price": 70.99,
        "image": "https://contents.mediadecathlon.com/m13368030/k$77e1ebc8dabdc680c5359fb12605f5b4/sq/kurzhantelset-6-x-kurze-hanteln-mit-20-kg.jpg?format=auto&f=969x969",
        "countInStock": 12,
        "colors": [
            "Red",
            "White",
            "Blue",
            "Black"
        ],
        "sizes": [
            "XL",
            "M"
        ],
        "description": "chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted",
        "numReviews": 12,
        "reviews": [
            {
                "author": "Victor",
                "text": "caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit",
                "date": "2021-04-01",
                "rating": 4
            },
            {
                "author": "Bob",
                "text": "ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop.",
                "date": "2023-10-03",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice",
                "date": "2023-01-31",
                "rating": 5
            },
            {
                "author": "Bob",
                "text": "cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut",
                "date": "2021-07-16",
                "rating": 4
            },
            {
                "author": "Oscar",
                "text": "Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake",
                "date": "2023-03-12",
                "rating": 3
            },
            {
                "author": "Mallory",
                "text": "I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2022-11-26",
                "rating": 3
            },
            {
                "author": "Kim",
                "text": "ipsum dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar",
                "date": "2023-01-13",
                "rating": 5
            },
            {
                "author": "Sybil",
                "text": "chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2022-01-02",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy",
                "date": "2022-10-07",
                "rating": 3
            },
            {
                "author": "Kim",
                "text": "tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels",
                "date": "2021-06-05",
                "rating": 5
            },
            {
                "author": "Quincy",
                "text": "chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding sweet muffin.",
                "date": "2023-07-08",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie",
                "date": "2021-06-09",
                "rating": 3
            }
        ],
        "averageRating": 3.9,
        "discount": 67
    },
    {
        "name": "CHRISTOPEIT",
        "category": "Hanteln",
        "price": 20.99,
        "image": "https://contents.mediadecathlon.com/m1028771/k$b70239067b8f2fac420aa3171e4b4745/sq/christopeit-hanteln-2-x-3-kg.jpg?format=auto&f=969x969",
        "countInStock": 50,
        "colors": [
            "Red",
            "Blue"
        ],
        "sizes": [
            "XL",
            "L",
            "S",
            "M"
        ],
        "description": "to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch. Chew iPad power cord",
        "numReviews": 15,
        "reviews": [
            {
                "author": "Barış",
                "text": "bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes",
                "date": "2020-05-20",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat",
                "date": "2023-03-27",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice",
                "date": "2021-08-18",
                "rating": 3
            },
            {
                "author": "Mallory",
                "text": "candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly",
                "date": "2022-10-03",
                "rating": 4
            },
            {
                "author": "Grace",
                "text": "tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton",
                "date": "2020-10-12",
                "rating": 4
            },
            {
                "author": "Dave",
                "text": "sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot",
                "date": "2023-09-21",
                "rating": 3
            },
            {
                "author": "Dave",
                "text": "candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake",
                "date": "2023-06-07",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2023-02-11",
                "rating": 3
            },
            {
                "author": "Nia",
                "text": "jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie",
                "date": "2021-12-22",
                "rating": 3
            },
            {
                "author": "Frank",
                "text": "Cupcake ipsum dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit",
                "date": "2022-05-05",
                "rating": 3
            },
            {
                "author": "Andreea",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake",
                "date": "2020-07-05",
                "rating": 4
            },
            {
                "author": "Nia",
                "text": "fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding",
                "date": "2021-05-28",
                "rating": 4
            },
            {
                "author": "Pat",
                "text": "shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love",
                "date": "2023-08-24",
                "rating": 4
            },
            {
                "author": "Pat",
                "text": "sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread",
                "date": "2022-03-30",
                "rating": 4
            },
            {
                "author": "Dave",
                "text": "bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu",
                "date": "2020-07-12",
                "rating": 4
            }
        ],
        "averageRating": 3.7,
        "discount": 54
    },
    {
        "name": "CORENGTH",
        "category": "Hanteln",
        "price": 55.99,
        "image": "https://contents.mediadecathlon.com/p2174842/k$7694ff37ee8fe79f8b7aa594743a3b2f/sq/hantel-15-kg-crosstraining-krafttraining-hex-dumbbell-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 94,
        "colors": [
            "Black",
            "Green",
            "Red",
            "White"
        ],
        "sizes": [
            "M",
            "XL",
            "L"
        ],
        "description": "your face destroy the blinds. Jump around on couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time",
        "numReviews": 17,
        "reviews": [
            {
                "author": "Pat",
                "text": "jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I",
                "date": "2020-11-29",
                "rating": 4
            },
            {
                "author": "Pat",
                "text": "jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée",
                "date": "2020-04-15",
                "rating": 3
            },
            {
                "author": "Kim",
                "text": "Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o",
                "date": "2022-11-03",
                "rating": 3
            },
            {
                "author": "Pat",
                "text": "lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton",
                "date": "2022-06-06",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll",
                "date": "2020-02-28",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love",
                "date": "2020-04-14",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll",
                "date": "2022-03-06",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake",
                "date": "2020-02-19",
                "rating": 5
            },
            {
                "author": "Grace",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit",
                "date": "2020-06-11",
                "rating": 5
            },
            {
                "author": "Trudy",
                "text": "tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie",
                "date": "2020-05-21",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding",
                "date": "2021-01-06",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop.",
                "date": "2021-12-29",
                "rating": 4
            },
            {
                "author": "Oscar",
                "text": "roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread.",
                "date": "2020-05-03",
                "rating": 5
            },
            {
                "author": "Bob",
                "text": "cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice",
                "date": "2023-11-02",
                "rating": 5
            },
            {
                "author": "Bob",
                "text": "donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love",
                "date": "2020-03-03",
                "rating": 3
            },
            {
                "author": "Oscar",
                "text": "amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple",
                "date": "2020-07-11",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly",
                "date": "2023-03-20",
                "rating": 4
            }
        ],
        "averageRating": 4.1
    },
    {
        "name": "MATCHU SPORTS",
        "category": "Hanteln",
        "price": 160.99,
        "image": "https://contents.mediadecathlon.com/m2664830/k$75109313446b2454516642a52642a8b7/sq/hantel-hex-dumbbell-20-kg-mit-gummigriff.jpg?format=auto&f=969x969",
        "countInStock": 16,
        "colors": [
            "Black"
        ],
        "sizes": [
            "XL"
        ],
        "description": "meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I",
        "numReviews": 1,
        "reviews": [
            {
                "author": "Randy",
                "text": "tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping.",
                "date": "2021-01-06",
                "rating": 3
            }
        ],
        "averageRating": 3.0,
        "discount": 53
    },
    {
        "name": "MUSCLE POWER",
        "category": "Hanteln",
        "price": 40.99,
        "image": "https://contents.mediadecathlon.com/m3906207/k$0dfb1c716a0c5d5a92c9fe5a86d04936/sq/hexa-hantel-pro-stuck.jpg?format=auto&f=969x969",
        "countInStock": 68,
        "colors": [
            "Green",
            "Blue",
            "Black",
            "Red"
        ],
        "sizes": [
            "XL",
            "L",
            "M"
        ],
        "description": "video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch.",
        "numReviews": 2,
        "reviews": [
            {
                "author": "Charlie",
                "text": "dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I",
                "date": "2022-02-08",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow",
                "date": "2020-10-22",
                "rating": 3
            }
        ],
        "averageRating": 3.5
    },
    {
        "name": "CORENGTH",
        "category": "Hanteln",
        "price": 85.99,
        "image": "https://contents.mediadecathlon.com/p2175081/k$8f08c974fb24095b37361ca5a61eee49/sq/hantel-225-kg-crosstraining-krafttraining-hex-dumbbell-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 0,
        "colors": [
            "Blue",
            "White"
        ],
        "sizes": [
            "M",
            "L",
            "XL",
            "S"
        ],
        "description": "sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot",
        "numReviews": 18,
        "reviews": [
            {
                "author": "Eve",
                "text": "roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton",
                "date": "2021-12-19",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread",
                "date": "2020-12-15",
                "rating": 5
            },
            {
                "author": "Bob",
                "text": "I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread",
                "date": "2021-02-04",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie",
                "date": "2023-12-25",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly",
                "date": "2021-11-13",
                "rating": 5
            },
            {
                "author": "Wendy",
                "text": "tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie",
                "date": "2020-05-11",
                "rating": 3
            },
            {
                "author": "Alice",
                "text": "sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread",
                "date": "2020-09-21",
                "rating": 3
            },
            {
                "author": "Bob",
                "text": "danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton",
                "date": "2022-11-10",
                "rating": 4
            },
            {
                "author": "Victor",
                "text": "jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread",
                "date": "2021-04-15",
                "rating": 3
            },
            {
                "author": "Ivan",
                "text": "apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie",
                "date": "2020-05-23",
                "rating": 3
            },
            {
                "author": "Grace",
                "text": "Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie",
                "date": "2023-07-28",
                "rating": 3
            },
            {
                "author": "Judy",
                "text": "bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame",
                "date": "2021-01-17",
                "rating": 5
            },
            {
                "author": "Barış",
                "text": "Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love",
                "date": "2023-03-23",
                "rating": 3
            },
            {
                "author": "Grace",
                "text": "tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut",
                "date": "2021-06-10",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2020-08-31",
                "rating": 4
            },
            {
                "author": "Oscar",
                "text": "pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie",
                "date": "2021-05-01",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop.",
                "date": "2022-12-12",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice",
                "date": "2022-05-08",
                "rating": 4
            }
        ],
        "averageRating": 3.8,
        "discount": 67
    },
    {
        "name": "SHAPEVITAL",
        "category": "Springseile",
        "price": 15.99,
        "image": "https://contents.mediadecathlon.com/m9462983/k$f906e2467fa1713077fb106d9d794f0c/sq/springseil-vital-fit-speed-rope-fur-kardio-und-intervalltraining.jpg?format=auto&f=969x969",
        "countInStock": 46,
        "colors": [
            "Red",
            "Blue",
            "Black",
            "Green",
            "White"
        ],
        "sizes": [
            "L",
            "M"
        ],
        "description": "bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate",
        "numReviews": 16,
        "reviews": [
            {
                "author": "Kim",
                "text": "cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish.",
                "date": "2023-06-19",
                "rating": 5
            },
            {
                "author": "Victor",
                "text": "candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels",
                "date": "2022-07-03",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake",
                "date": "2021-03-18",
                "rating": 3
            },
            {
                "author": "Eve",
                "text": "brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly",
                "date": "2021-06-14",
                "rating": 5
            },
            {
                "author": "Nia",
                "text": "I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly",
                "date": "2021-12-25",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée",
                "date": "2021-08-12",
                "rating": 4
            },
            {
                "author": "Charlie",
                "text": "jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll",
                "date": "2023-01-04",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop.",
                "date": "2020-02-13",
                "rating": 5
            },
            {
                "author": "Trudy",
                "text": "tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish.",
                "date": "2023-01-11",
                "rating": 5
            },
            {
                "author": "Wendy",
                "text": "biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping.",
                "date": "2021-11-27",
                "rating": 5
            },
            {
                "author": "Judy",
                "text": "Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2021-09-21",
                "rating": 4
            },
            {
                "author": "Dave",
                "text": "ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton",
                "date": "2023-06-28",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2020-03-23",
                "rating": 4
            },
            {
                "author": "Grace",
                "text": "love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake",
                "date": "2020-01-30",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2023-06-24",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake",
                "date": "2020-09-18",
                "rating": 4
            }
        ],
        "averageRating": 4.2
    },
    {
        "name": "ELITE ATHLETE",
        "category": "Springseile",
        "price": 22.99,
        "image": "https://contents.mediadecathlon.com/m10655946/k$e6ac378a6dc8fb2d1db8d132b01ca6fb/sq/eliteathlete-premium-springseil-herren-damen-speed-rope.jpg?format=auto&f=969x969",
        "countInStock": 11,
        "colors": [
            "Red",
            "White",
            "Blue"
        ],
        "sizes": [
            "L",
            "XL"
        ],
        "description": "now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch",
        "numReviews": 4,
        "reviews": [
            {
                "author": "Eve",
                "text": "I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2020-08-31",
                "rating": 4
            },
            {
                "author": "Oscar",
                "text": "ipsum dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake",
                "date": "2021-08-05",
                "rating": 5
            },
            {
                "author": "Judy",
                "text": "cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop",
                "date": "2021-08-26",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2021-01-07",
                "rating": 4
            }
        ],
        "averageRating": 4.2
    },
    {
        "name": "NORTHWALL",
        "category": "Springseile",
        "price": 36.99,
        "image": "https://contents.mediadecathlon.com/m6819991/k$32c0c69f249a012cddf4fdcc75becb7d/sq/northwall-s1-verstellbares-springseil.jpg?format=auto&f=969x969",
        "countInStock": 5,
        "colors": [
            "Blue",
            "Green",
            "White"
        ],
        "sizes": [
            "L"
        ],
        "description": "blinds. Jump around on couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love",
        "numReviews": 4,
        "reviews": [
            {
                "author": "Eve",
                "text": "cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels",
                "date": "2023-02-10",
                "rating": 5
            },
            {
                "author": "Alice",
                "text": "Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar",
                "date": "2020-02-19",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice",
                "date": "2023-10-20",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans",
                "date": "2021-07-17",
                "rating": 4
            }
        ],
        "averageRating": 4.2
    },
    {
        "name": "TUNTURI",
        "category": "Springseile",
        "price": 40.99,
        "image": "https://contents.mediadecathlon.com/m14952334/k$a0f4f5518fd318d4139476aa2924e70b/sq/verstellbares-springseil-pro-speed-rope-3m-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 21,
        "colors": [
            "White",
            "Black",
            "Green",
            "Blue"
        ],
        "sizes": [
            "M",
            "S",
            "L",
            "XL"
        ],
        "description": "my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch.",
        "numReviews": 1,
        "reviews": [
            {
                "author": "Barış",
                "text": "Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding",
                "date": "2022-10-09",
                "rating": 3
            }
        ],
        "averageRating": 3.0
    },
    {
        "name": "VIA FORTIS",
        "category": "Springseile",
        "price": 25.99,
        "image": "https://contents.mediadecathlon.com/m2457363/k$9324329ed109b05fb612a6e2aa894e4d/sq/profi-springseil-mit-gewichten-langenverstellbar-mit-tasche-and-ersatzseil.jpg?format=auto&f=969x969",
        "countInStock": 3,
        "colors": [
            "Blue",
            "Green",
            "Red",
            "White"
        ],
        "sizes": [
            "XL",
            "S",
            "M"
        ],
        "description": "face destroy the blinds. Jump around on couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now",
        "numReviews": 4,
        "reviews": [
            {
                "author": "Wendy",
                "text": "cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2020-02-11",
                "rating": 3
            },
            {
                "author": "Nia",
                "text": "pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy",
                "date": "2024-02-02",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream.",
                "date": "2022-09-10",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy",
                "date": "2021-06-26",
                "rating": 4
            }
        ],
        "averageRating": 3.8
    },
    {
        "name": "REUSCH",
        "category": "Skihandschuhe",
        "price": 40.99,
        "image": "https://contents.mediadecathlon.com/p2528845/k$927e6f1741e716528b75cee31918923f/sq/skihandschuhe-herren-gore-tex-reusch-snow-spirit.jpg?format=auto&f=969x969",
        "countInStock": 4,
        "colors": [
            "Green",
            "Blue",
            "White"
        ],
        "sizes": [
            "M",
            "XL",
            "L",
            "S"
        ],
        "description": "the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase",
        "numReviews": 3,
        "reviews": [
            {
                "author": "Wendy",
                "text": "pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes",
                "date": "2022-11-12",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot",
                "date": "2020-12-07",
                "rating": 3
            },
            {
                "author": "Bob",
                "text": "lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy",
                "date": "2023-02-01",
                "rating": 4
            }
        ],
        "averageRating": 3.7
    },
    {
        "name": "REUSCH",
        "category": "Handschuhe",
        "price": 33.99,
        "image": "https://contents.mediadecathlon.com/m4450099/k$26bc8ff8177032331a095d5065a667d8/sq/reusch-handschuhe-multisport-glove-gore-tex-infinium.jpg?format=auto&f=969x969",
        "countInStock": 81,
        "colors": [
            "Blue"
        ],
        "sizes": [
            "M",
            "S",
            "XL"
        ],
        "description": "going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch. Chew iPad power cord soft",
        "numReviews": 1,
        "reviews": [
            {
                "author": "Victor",
                "text": "topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes",
                "date": "2022-11-17",
                "rating": 4
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "SOLOGNAC",
        "category": "Jagdhandschuhe",
        "price": 30.99,
        "image": "https://contents.mediadecathlon.com/p1902371/k$642d82c2934c4da77c826ab2a971d8c0/sq/jagdhandschuhe-faustlinge-900-warm.jpg?format=auto&f=969x969",
        "countInStock": 97,
        "colors": [
            "Blue",
            "Green"
        ],
        "sizes": [
            "XL",
            "L"
        ],
        "description": "red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun",
        "numReviews": 12,
        "reviews": [
            {
                "author": "Grace",
                "text": "apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton",
                "date": "2022-03-13",
                "rating": 4
            },
            {
                "author": "Nia",
                "text": "Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love",
                "date": "2020-10-31",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut",
                "date": "2024-02-07",
                "rating": 5
            },
            {
                "author": "Ömer",
                "text": "love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake",
                "date": "2023-06-16",
                "rating": 4
            },
            {
                "author": "Dave",
                "text": "plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice",
                "date": "2020-11-10",
                "rating": 3
            },
            {
                "author": "Heidi",
                "text": "Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy",
                "date": "2021-06-26",
                "rating": 4
            },
            {
                "author": "Grace",
                "text": "I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly",
                "date": "2024-02-08",
                "rating": 4
            },
            {
                "author": "Eve",
                "text": "donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate",
                "date": "2022-12-16",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll",
                "date": "2022-03-23",
                "rating": 3
            },
            {
                "author": "Victor",
                "text": "plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice",
                "date": "2021-07-09",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw.",
                "date": "2021-04-04",
                "rating": 4
            },
            {
                "author": "Barış",
                "text": "caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar",
                "date": "2023-10-01",
                "rating": 4
            }
        ],
        "averageRating": 3.9,
        "discount": 51
    },
    {
        "name": "WEDZE",
        "category": "Skihandschuhe ",
        "price": 40.99,
        "image": "https://contents.mediadecathlon.com/p2579055/k$cd6b61f0c2119aeddf83e56090318991/sq/skihandschuhe-kinder-warm-wasserdicht-900-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 50,
        "colors": [
            "Black",
            "Green",
            "White",
            "Red",
            "Blue"
        ],
        "sizes": [
            "L",
            "XL"
        ],
        "description": "my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe.",
        "numReviews": 16,
        "reviews": [
            {
                "author": "Sybil",
                "text": "lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit",
                "date": "2020-03-06",
                "rating": 5
            },
            {
                "author": "Mallory",
                "text": "jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée",
                "date": "2023-10-19",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps",
                "date": "2021-07-21",
                "rating": 3
            },
            {
                "author": "Ömer",
                "text": "jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I",
                "date": "2022-12-23",
                "rating": 3
            },
            {
                "author": "Nia",
                "text": "I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar",
                "date": "2021-07-23",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake",
                "date": "2021-11-13",
                "rating": 3
            },
            {
                "author": "Eve",
                "text": "liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton",
                "date": "2023-07-31",
                "rating": 5
            },
            {
                "author": "Charlie",
                "text": "sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I",
                "date": "2022-02-25",
                "rating": 3
            },
            {
                "author": "Oscar",
                "text": "love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar",
                "date": "2023-09-29",
                "rating": 4
            },
            {
                "author": "Dave",
                "text": "love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake",
                "date": "2022-02-25",
                "rating": 4
            },
            {
                "author": "Bob",
                "text": "jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate",
                "date": "2021-04-13",
                "rating": 4
            },
            {
                "author": "Bob",
                "text": "liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut",
                "date": "2022-09-12",
                "rating": 4
            },
            {
                "author": "Ivan",
                "text": "biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans",
                "date": "2022-07-15",
                "rating": 4
            },
            {
                "author": "Nia",
                "text": "jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2022-12-11",
                "rating": 4
            },
            {
                "author": "Charlie",
                "text": "chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2023-02-10",
                "rating": 4
            },
            {
                "author": "Judy",
                "text": "dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer",
                "date": "2020-11-24",
                "rating": 4
            }
        ],
        "averageRating": 3.9
    },
    {
        "name": "WEDZE",
        "category": "Skihandschuhe",
        "price": 60.99,
        "image": "https://contents.mediadecathlon.com/p2579333/k$212a9df773ff9a49d355ecd344368778/sq/skihandschuhe-erwachsene-freeride-900-braunschwarz.jpg?format=auto&f=969x969",
        "countInStock": 71,
        "colors": [
            "Blue",
            "Green",
            "Black",
            "Red",
            "White"
        ],
        "sizes": [
            "XL",
            "M",
            "L",
            "S"
        ],
        "description": "anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad",
        "numReviews": 7,
        "reviews": [
            {
                "author": "Ivan",
                "text": "amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé",
                "date": "2023-09-01",
                "rating": 3
            },
            {
                "author": "Sybil",
                "text": "claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie",
                "date": "2022-07-27",
                "rating": 4
            },
            {
                "author": "Barış",
                "text": "cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2021-12-19",
                "rating": 4
            },
            {
                "author": "Victor",
                "text": "pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee",
                "date": "2023-03-04",
                "rating": 4
            },
            {
                "author": "Kim",
                "text": "bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet",
                "date": "2022-07-17",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I",
                "date": "2022-04-29",
                "rating": 5
            },
            {
                "author": "Heidi",
                "text": "Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop",
                "date": "2020-04-08",
                "rating": 4
            }
        ],
        "averageRating": 4.0,
        "discount": 40
    },
    {
        "name": "FOUGANZA",
        "category": "Reithandschuhe",
        "price": 30.99,
        "image": "https://contents.mediadecathlon.com/p2490367/k$e474981cc944a1395f8ca86b4077a183/sq/reithandschuhe-classic-leder-damenherren-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 35,
        "colors": [
            "Red",
            "Black"
        ],
        "sizes": [
            "XL",
            "M"
        ],
        "description": "dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad power cord. Stare at ceiling chase mice sun bathe. Hate dog sun bathe stretch. Chew iPad power cord soft kitty warm kitty little ball of",
        "numReviews": 20,
        "reviews": [
            {
                "author": "Sybil",
                "text": "Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread",
                "date": "2023-01-04",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton",
                "date": "2020-01-14",
                "rating": 3
            },
            {
                "author": "Eve",
                "text": "I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake",
                "date": "2022-09-12",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie",
                "date": "2023-06-27",
                "rating": 4
            },
            {
                "author": "Randy",
                "text": "jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding",
                "date": "2023-01-13",
                "rating": 4
            },
            {
                "author": "Wendy",
                "text": "topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie",
                "date": "2020-06-27",
                "rating": 4
            },
            {
                "author": "Charlie",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée",
                "date": "2020-03-24",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels",
                "date": "2021-04-24",
                "rating": 5
            },
            {
                "author": "Barış",
                "text": "ipsum dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé",
                "date": "2021-07-21",
                "rating": 5
            },
            {
                "author": "Ömer",
                "text": "chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw.",
                "date": "2021-08-27",
                "rating": 5
            },
            {
                "author": "Sybil",
                "text": "I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2023-10-04",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice",
                "date": "2022-01-25",
                "rating": 5
            },
            {
                "author": "Eve",
                "text": "lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy",
                "date": "2020-11-30",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2023-02-05",
                "rating": 3
            },
            {
                "author": "Kim",
                "text": "danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love",
                "date": "2020-10-04",
                "rating": 4
            },
            {
                "author": "Nia",
                "text": "claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake",
                "date": "2022-05-02",
                "rating": 4
            },
            {
                "author": "Trudy",
                "text": "Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread",
                "date": "2023-06-08",
                "rating": 5
            },
            {
                "author": "Victor",
                "text": "love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie",
                "date": "2020-03-21",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love",
                "date": "2020-12-24",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut",
                "date": "2024-01-03",
                "rating": 5
            }
        ],
        "averageRating": 4.2,
        "discount": 57
    },
    {
        "name": "OPTIMUM NUTRITION",
        "category": "Opti-Men",
        "price": 20.99,
        "image": "https://contents.mediadecathlon.com/m11517931/k$2612c5295ef9de7ad36630818acb798d/sq/opti-men-180tabs-optimum-nutrition.jpg?format=auto&f=969x969",
        "countInStock": 55,
        "colors": [
            "White",
            "Black",
            "Green",
            "Blue"
        ],
        "sizes": [
            "XL",
            "S",
            "M"
        ],
        "description": "internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today.",
        "numReviews": 6,
        "reviews": [
            {
                "author": "Oscar",
                "text": "plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie",
                "date": "2022-12-29",
                "rating": 3
            },
            {
                "author": "Andreea",
                "text": "chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart",
                "date": "2022-10-26",
                "rating": 3
            },
            {
                "author": "Barış",
                "text": "brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I",
                "date": "2023-09-23",
                "rating": 3
            },
            {
                "author": "Mallory",
                "text": "tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut",
                "date": "2023-09-26",
                "rating": 4
            },
            {
                "author": "Oscar",
                "text": "cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding",
                "date": "2024-01-13",
                "rating": 4
            },
            {
                "author": "Oscar",
                "text": "Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice",
                "date": "2022-10-15",
                "rating": 4
            }
        ],
        "averageRating": 3.5
    },
    {
        "name": "POWERBAR",
        "category": "Energy-Gel Hydrogel",
        "price": 45.99,
        "image": "https://contents.mediadecathlon.com/p2277809/k$e7abdbba7dcb16f69997d452e0ae71c1/sq/energy-gel-hydrogel-multipack-cola-x24.jpg?format=auto&f=969x969",
        "countInStock": 33,
        "colors": [
            "Red",
            "Green"
        ],
        "sizes": [
            "L",
            "S",
            "M"
        ],
        "description": "dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today.",
        "numReviews": 10,
        "reviews": [
            {
                "author": "Ivan",
                "text": "apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat",
                "date": "2022-09-19",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly",
                "date": "2021-05-05",
                "rating": 3
            },
            {
                "author": "Barış",
                "text": "I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie",
                "date": "2022-01-13",
                "rating": 3
            },
            {
                "author": "Trudy",
                "text": "I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar",
                "date": "2020-08-14",
                "rating": 3
            },
            {
                "author": "Trudy",
                "text": "pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels",
                "date": "2022-11-02",
                "rating": 4
            },
            {
                "author": "Oscar",
                "text": "jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish.",
                "date": "2021-09-15",
                "rating": 4
            },
            {
                "author": "Heidi",
                "text": "caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer",
                "date": "2020-08-23",
                "rating": 4
            },
            {
                "author": "Charlie",
                "text": "cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar",
                "date": "2023-05-13",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon",
                "date": "2023-04-21",
                "rating": 4
            },
            {
                "author": "Sybil",
                "text": "lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes",
                "date": "2020-05-07",
                "rating": 5
            }
        ],
        "averageRating": 3.8
    },
    {
        "name": "DOMYOS",
        "category": "Proteinpulver",
        "price": 30.99,
        "image": "https://contents.mediadecathlon.com/p2367921/k$c3ceefdc246a9ed9ae1b5a7e122dc9f4/sq/proteinpulver-whey-isolate-schoko-900-g.jpg?format=auto&f=969x969",
        "countInStock": 22,
        "colors": [
            "Black",
            "Blue",
            "Green"
        ],
        "sizes": [
            "S"
        ],
        "description": "posted to internet for chasing red dot. I love cuddles going to catch the red dot today going to catch the red dot today. Run in circles chew iPad",
        "numReviews": 19,
        "reviews": [
            {
                "author": "Randy",
                "text": "I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll",
                "date": "2022-12-24",
                "rating": 3
            },
            {
                "author": "Heidi",
                "text": "cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream",
                "date": "2023-11-12",
                "rating": 3
            },
            {
                "author": "Bob",
                "text": "bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice",
                "date": "2023-06-20",
                "rating": 4
            },
            {
                "author": "Quincy",
                "text": "tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar",
                "date": "2023-07-22",
                "rating": 4
            },
            {
                "author": "Judy",
                "text": "brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream.",
                "date": "2021-02-06",
                "rating": 3
            },
            {
                "author": "Frank",
                "text": "ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie",
                "date": "2023-07-19",
                "rating": 4
            },
            {
                "author": "Bob",
                "text": "candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton",
                "date": "2023-02-01",
                "rating": 4
            },
            {
                "author": "Ömer",
                "text": "candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée",
                "date": "2023-02-24",
                "rating": 3
            },
            {
                "author": "Mallory",
                "text": "ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding.",
                "date": "2020-10-05",
                "rating": 5
            },
            {
                "author": "Frank",
                "text": "pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly",
                "date": "2024-01-28",
                "rating": 4
            },
            {
                "author": "Charlie",
                "text": "gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart",
                "date": "2020-09-11",
                "rating": 4
            },
            {
                "author": "Dave",
                "text": "biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread",
                "date": "2021-09-16",
                "rating": 5
            },
            {
                "author": "Grace",
                "text": "jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice",
                "date": "2023-01-24",
                "rating": 3
            },
            {
                "author": "Bob",
                "text": "I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate",
                "date": "2023-11-11",
                "rating": 5
            },
            {
                "author": "Mallory",
                "text": "ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes",
                "date": "2021-03-25",
                "rating": 5
            },
            {
                "author": "Alice",
                "text": "cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart",
                "date": "2022-04-25",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop",
                "date": "2022-09-22",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes",
                "date": "2023-02-21",
                "rating": 3
            },
            {
                "author": "Trudy",
                "text": "brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice",
                "date": "2022-08-26",
                "rating": 4
            }
        ],
        "averageRating": 3.9
    },
    {
        "name": "OPTIMUM NUTRITION",
        "category": "Protein Extreme Milk Chocolate",
        "price": 45.99,
        "image": "https://contents.mediadecathlon.com/m14581009/k$e99ba0248f5c6aad6d19c1937a6ade93/sq/gold-standard-100-whey-protein-extreme-milk-chocolate-71-portionen-2270-gramm.jpg?format=auto&f=969x969",
        "countInStock": 88,
        "colors": [
            "Red",
            "Black"
        ],
        "sizes": [
            "XL",
            "S",
            "M",
            "L"
        ],
        "description": "around on couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I",
        "numReviews": 0,
        "reviews": [],
        "averageRating": 0
    },
    {
        "name": "FSA NUTRITION",
        "category": "Protein Shaker 800ml",
        "price": 15.99,
        "image": "https://contents.mediadecathlon.com/m11612817/k$274af6328412af270b006f945df1e836/sq/protein-shaker-800ml-auslaufsichere-trinkflasche-schwarz.jpg?format=auto&f=969x969",
        "countInStock": 34,
        "colors": [
            "Green",
            "Blue"
        ],
        "sizes": [
            "M"
        ],
        "description": "chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot. I love cuddles",
        "numReviews": 1,
        "reviews": [
            {
                "author": "Mallory",
                "text": "gingerbread. I love biscuit caramels dragée carrot cake jelly-o donut sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake",
                "date": "2022-12-12",
                "rating": 4
            }
        ],
        "averageRating": 4.0
    },
    {
        "name": "OPTIMUM NUTRITION",
        "category": "Gainer Serious Mass",
        "price": 45.99,
        "image": "https://contents.mediadecathlon.com/m10817520/k$198a1846c73b2651f7de968c88d6af12/sq/gainer-serious-mass-273kg-optimum-nutrition.jpg?format=auto&f=969x969",
        "countInStock": 52,
        "colors": [
            "White"
        ],
        "sizes": [
            "XL",
            "S",
            "M"
        ],
        "description": "Purr sleep on your face destroy the blinds. Jump around on couch, meow constantly until given food, and chase imaginary bugs, yet chase imaginary bugs. Hate dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red",
        "numReviews": 3,
        "reviews": [
            {
                "author": "Eve",
                "text": "soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie",
                "date": "2020-06-23",
                "rating": 5
            },
            {
                "author": "Andreea",
                "text": "tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart",
                "date": "2021-11-29",
                "rating": 4
            },
            {
                "author": "Alice",
                "text": "tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps",
                "date": "2022-06-18",
                "rating": 5
            }
        ],
        "averageRating": 4.7
    },
    {
        "name": "WEIDER",
        "category": "Proteinpulver Vegan",
        "price": 28.99,
        "image": "https://contents.mediadecathlon.com/p2483448/k$ad8075ed76501e6440b95515aea41ace/sq/proteinpulver-vegan-750-g-schokolade.jpg?format=auto&f=969x969",
        "countInStock": 8,
        "colors": [
            "Red",
            "Black",
            "Green"
        ],
        "sizes": [
            "S",
            "XL",
            "M",
            "L"
        ],
        "description": "dog hunt anything that moves. Play time sweet beast. Your pillow is now my pet bed get video posted to internet for chasing red dot.",
        "numReviews": 18,
        "reviews": [
            {
                "author": "Bob",
                "text": "soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2023-03-02",
                "rating": 4
            },
            {
                "author": "Andreea",
                "text": "caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I",
                "date": "2021-01-20",
                "rating": 4
            },
            {
                "author": "Charlie",
                "text": "cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love biscuit",
                "date": "2023-01-07",
                "rating": 3
            },
            {
                "author": "Andreea",
                "text": "pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish.",
                "date": "2022-11-06",
                "rating": 3
            },
            {
                "author": "Sybil",
                "text": "love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice",
                "date": "2020-10-01",
                "rating": 3
            },
            {
                "author": "Sybil",
                "text": "bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice",
                "date": "2022-06-13",
                "rating": 4
            },
            {
                "author": "Nia",
                "text": "bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry",
                "date": "2022-09-16",
                "rating": 4
            },
            {
                "author": "Dave",
                "text": "dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2024-01-14",
                "rating": 5
            },
            {
                "author": "Dave",
                "text": "cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate I love I love macaroon donut pudding. Danish brownie jelly wafer pudding",
                "date": "2023-02-05",
                "rating": 5
            },
            {
                "author": "Sybil",
                "text": "jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee",
                "date": "2022-05-29",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I love",
                "date": "2020-09-10",
                "rating": 3
            },
            {
                "author": "Dave",
                "text": "Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice",
                "date": "2020-01-03",
                "rating": 5
            },
            {
                "author": "Frank",
                "text": "ice cream. Toffee liquorice jelly-o lollipop pie donut topping. Liquorice jujubes tiramisu cotton candy sweet roll sesame snaps lollipop. Tiramisu jelly tootsie roll oat cake I love brownie jelly danish. Shortbread brownie jujubes pastry cotton candy brownie gingerbread. I",
                "date": "2023-06-17",
                "rating": 4
            },
            {
                "author": "Mallory",
                "text": "chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice",
                "date": "2023-04-14",
                "rating": 4
            },
            {
                "author": "Frank",
                "text": "sweet. Marshmallow cotton candy shortbread marshmallow caramels gingerbread I love chocolate cake ice cream. Jelly beans shortbread fruitcake biscuit chocolate bar cheesecake I love chocolate cake. Brownie sugar plum chocolate",
                "date": "2020-10-29",
                "rating": 4
            },
            {
                "author": "Judy",
                "text": "ipsum dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice",
                "date": "2022-08-10",
                "rating": 5
            },
            {
                "author": "Bob",
                "text": "sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream",
                "date": "2023-01-22",
                "rating": 5
            },
            {
                "author": "Pat",
                "text": "dolor sit amet jelly carrot cake gummies. Donut tootsie roll pudding chocolate bar jelly candy. Fruitcake chocolate bar chocolate cake sugar plum cupcake jelly-o soufflé tiramisu. Soufflé I love biscuit tart apple pie bear claw. I love jelly-o lollipop tart shortbread ice cream halvah ice cream. Toffee liquorice jelly-o",
                "date": "2023-12-07",
                "rating": 3
            }
        ],
        "averageRating": 4.0
    }
]